Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/**
 * \file IfxDmu_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC39XA_ITS_V3.0.R0
 * Specification: DMU_AURIXTC3XX_its_MCSFR.xml
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Dmu Dmu
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Dmu_Bitfields Bitfields
 * \ingroup IfxLld_Dmu
 * 
 * \defgroup IfxLld_Dmu_union Union
 * \ingroup IfxLld_Dmu
 * 
 * \defgroup IfxLld_Dmu_struct Struct
 * \ingroup IfxLld_Dmu
 * 
 */
#ifndef IFXDMU_REGDEF_H
#define IFXDMU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Dmu_Bitfields
 * \{  */

/** \brief  Access Enable Register 0 */
typedef struct _Ifx_DMU_HF_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID 0 (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID 1 (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID 2 (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID 3 (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID 4 (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID 5 (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID 6 (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID 7 (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID 8 (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID 9 (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID 10 (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID 11 (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID 12 (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID 13 (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID 14 (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID 15 (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID 16 (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID 17 (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID 18 (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID 19 (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID 20 (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID 21 (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID 22 (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID 23 (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID 24 (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID 25 (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID 26 (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID 27 (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID 28 (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID 29 (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID 30 (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID 31 (rw) */
} Ifx_DMU_HF_ACCEN0_Bits;

/** \brief  Access Enable Register 1 */
typedef struct _Ifx_DMU_HF_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_ACCEN1_Bits;

/** \brief  Cranking Control Register */
typedef struct _Ifx_DMU_HF_CCONTROL_Bits
{
    unsigned int CRANKING:2;                /**< \brief [1:0] Cranking Mode Control (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_CCONTROL_Bits;

/** \brief  Clear Error Register */
typedef struct _Ifx_DMU_HF_CLRE_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int CSQER:1;                   /**< \brief [1:1] Clear Command Sequence Error (w) */
    unsigned int CPROER:1;                  /**< \brief [2:2] Clear Protection Error (w) */
    unsigned int CPVER:1;                   /**< \brief [3:3] Clear Program Verify Error (w) */
    unsigned int CEVER:1;                   /**< \brief [4:4] Clear Erase Verify Error (w) */
    unsigned int CADER:1;                   /**< \brief [5:5] Clear SRI Bus Address ECC Error (w) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_CLRE_Bits;

/** \brief  Flash Confirm Status Register 0 */
typedef struct _Ifx_DMU_HF_CONFIRM0_Bits
{
    unsigned int PROINBMHD0O:2;             /**< \brief [1:0] UCB_BMHD0_ORIG Confirmation (rh) */
    unsigned int PROINBMHD1O:2;             /**< \brief [3:2] UCB_BMHD1_ORIG Confirmation (rh) */
    unsigned int PROINBMHD2O:2;             /**< \brief [5:4] UCB_BMHD2_ORIG Confirmation (rh) */
    unsigned int PROINBMHD3O:2;             /**< \brief [7:6] UCB_BMHD3_ORIG Confirmation (rh) */
    unsigned int PROINSSW:2;                /**< \brief [9:8] UCB_SSW Confirmation (rh) */
    unsigned int PROINUSER:2;               /**< \brief [11:10] UCB_USER Confirmation (rh) */
    unsigned int PROINTEST:2;               /**< \brief [13:12] UCB_TEST Confirmation (rh) */
    unsigned int PROINHSMCFG:2;             /**< \brief [15:14] UCB_HSMCFG Confirmation (rh) */
    unsigned int PROINBMHD0C:2;             /**< \brief [17:16] UCB_BMHD0_COPY Confirmation (rh) */
    unsigned int PROINBMHD1C:2;             /**< \brief [19:18] UCB_BMHD1_COPY Confirmation (rh) */
    unsigned int PROINBMHD2C:2;             /**< \brief [21:20] UCB_BMHD2_COPY Confirmation (rh) */
    unsigned int PROINBMHD3C:2;             /**< \brief [23:22] UCB_BMHD3_COPY Confirmation (rh) */
    unsigned int reserved_24:6;             /**< \brief \internal Reserved */
    unsigned int PROINSRT:2;                /**< \brief [31:30] UCB_RETEST Confirmation (rh) */
} Ifx_DMU_HF_CONFIRM0_Bits;

