Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  Flash Confirm Status Register 1 */
typedef struct _Ifx_DMU_HF_CONFIRM1_Bits
{
    unsigned int PROINPO:2;                 /**< \brief [1:0] UCB_PFLASH_ORIG Confirmation (rh) */
    unsigned int PROINDO:2;                 /**< \brief [3:2] UCB_DFLASH_ORIG Confirmation (rh) */
    unsigned int PROINDBGO:2;               /**< \brief [5:4] UCB_DBG_ORIG Confirmation (rh) */
    unsigned int PROINHSMO:2;               /**< \brief [7:6] UCB_HSM_ORIG Confirmation (rh) */
    unsigned int PROINHSMCOTP0O:2;          /**< \brief [9:8] UCB_HSMCOTP0_ORIG Protection (rh) */
    unsigned int PROINHSMCOTP1O:2;          /**< \brief [11:10] UCB_HSMCOTP1_ORIG Protection (rh) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int PROINPC:2;                 /**< \brief [17:16] UCB_PFLASH_COPY Confirmation (rh) */
    unsigned int PROINDC:2;                 /**< \brief [19:18] UCB_DFLASH_COPY Confirmation (rh) */
    unsigned int PROINDBGC:2;               /**< \brief [21:20] UCB_DBG_COPY Interface Confirmation (rh) */
    unsigned int PROINHSMC:2;               /**< \brief [23:22] UCB_HSM_COPY Confirmation (rh) */
    unsigned int PROINHSMCOTP0C:2;          /**< \brief [25:24] UCB_HSMCOTP0_COPY Protection (rh) */
    unsigned int PROINHSMCOTP1C:2;          /**< \brief [27:26] UCB_HSMCOTP1_COPY Protection (rh) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_CONFIRM1_Bits;

/** \brief  Flash Confirm Status Register 2 */
typedef struct _Ifx_DMU_HF_CONFIRM2_Bits
{
    unsigned int PROINOTP0O:2;              /**< \brief [1:0] UCB_OTP0_ORIG Confirmation (rh) */
    unsigned int PROINOTP1O:2;              /**< \brief [3:2] UCB_OTP1_ORIG Confirmation (rh) */
    unsigned int PROINOTP2O:2;              /**< \brief [5:4] UCB_OTP2_ORIG Confirmation (rh) */
    unsigned int PROINOTP3O:2;              /**< \brief [7:6] UCB_OTP3_ORIG Confirmation (rh) */
    unsigned int PROINOTP4O:2;              /**< \brief [9:8] UCB_OTP4_ORIG Confirmation (rh) */
    unsigned int PROINOTP5O:2;              /**< \brief [11:10] UCB_OTP5_ORIG Confirmation (rh) */
    unsigned int PROINOTP6O:2;              /**< \brief [13:12] UCB_OTP6_ORIG Confirmation (rh) */
    unsigned int PROINOTP7O:2;              /**< \brief [15:14] UCB_OTP7_ORIG Confirmation (rh) */
    unsigned int PROINOTP0C:2;              /**< \brief [17:16] UCB_OTP0_COPY Confirmation (rh) */
    unsigned int PROINOTP1C:2;              /**< \brief [19:18] UCB_OTP1_COPY Confirmation (rh) */
    unsigned int PROINOTP2C:2;              /**< \brief [21:20] UCB_OTP2_COPY Confirmation (rh) */
    unsigned int PROINOTP3C:2;              /**< \brief [23:22] UCB_OTP3_COPY Confirmation (rh) */
    unsigned int PROINOTP4C:2;              /**< \brief [25:24] UCB_OTP4_COPY Confirmation (rh) */
    unsigned int PROINOTP5C:2;              /**< \brief [27:26] UCB_OTP5_COPY Confirmation (rh) */
    unsigned int PROINOTP6C:2;              /**< \brief [29:28] UCB_OTP6_COPY Confirmation (rh) */
    unsigned int PROINOTP7C:2;              /**< \brief [31:30] UCB_OTP7_COPY Confirmation (rh) */
} Ifx_DMU_HF_CONFIRM2_Bits;

/** \brief  Flash Control Register */
typedef struct _Ifx_DMU_HF_CONTROL_Bits
{
    unsigned int FSISTART:3;                /**< \brief [2:0] Start FSI (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int FSIENPE:2;                 /**< \brief [5:4] Enable Program/Erase (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int DDFP:1;                    /**< \brief [8:8] Disable Read from PFLASH (rwh) */
    unsigned int DDFD:1;                    /**< \brief [9:9] Disable Data Fetch from DF0_EEPROM (rwh) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int CPROG:1;                   /**< \brief [16:16] Clear Programming State (w) */
    unsigned int CERASE:1;                  /**< \brief [17:17] Clear Erase State (w) */
    unsigned int CUSER:1;                   /**< \brief [18:18] Clear User State (w) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_DMU_HF_CONTROL_Bits;

/** \brief  DFLASH Size Configuration Register */
typedef struct _Ifx_DMU_HF_DSIZE_Bits
{
    unsigned int reserved_0:5;              /**< \brief \internal Reserved */
    unsigned int DF0:4;                     /**< \brief [8:5] Size of Data Flash Bank 0 (rw) */
    unsigned int reserved_9:12;             /**< \brief \internal Reserved */
    unsigned int DF1:1;                     /**< \brief [21:21] Size of Data Flash Bank 1 (rw) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DMU_HF_DSIZE_Bits;

/** \brief  DFLASH Wait Cycle Register */
typedef struct _Ifx_DMU_HF_DWAIT_Bits
{
    unsigned int RFLASH1:8;                 /**< \brief [7:0] Operation Mode (rw) */
    unsigned int RFLASH2:8;                 /**< \brief [15:8] Operation Mode (rw) */
    unsigned int RECC:3;                    /**< \brief [18:16] Operation Mode (rw) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_DMU_HF_DWAIT_Bits;

/** \brief  DF0 ECC Control Register */
typedef struct _Ifx_DMU_HF_ECCC_Bits
{
    unsigned int CLR:2;                     /**< \brief [1:0] Clear ECC status bits (w) */
    unsigned int reserved_2:26;             /**< \brief \internal Reserved */
    unsigned int ECCCORDIS:2;               /**< \brief [29:28] Host Command Interface ECC Correction Disable (rw) */
    unsigned int TRAPDIS:2;                 /**< \brief [31:30] Host Command Interface Uncorrectable ECC Bit Error Trap Disable (rw) */
} Ifx_DMU_HF_ECCC_Bits;

/** \brief  DF0 ECC Read Register */
typedef struct _Ifx_DMU_HF_ECCR_Bits
{
    unsigned int RCODE:22;                  /**< \brief [21:0] Error Correction Read Code (rh) */
    unsigned int RED:2;                     /**< \brief [23:22] Redundant Bits (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_ECCR_Bits;

/** \brief  DF0 ECC Status Register */
typedef struct _Ifx_DMU_HF_ECCS_Bits
{
    unsigned int ERR1:1;                    /**< \brief [0:0] Read Access Single Bit ECC Error (rh) */
    unsigned int ERR2:1;                    /**< \brief [1:1] Read Access Double Bit ECC Error (rh) */
    unsigned int ERR3:1;                    /**< \brief [2:2] Read Access Triple Bit ECC Error (rh) */
    unsigned int ERRM:1;                    /**< \brief [3:3] Read Access Multi-bit ECC Error (rh) */
    unsigned int reserved_4:3;              /**< \brief \internal Reserved */
    unsigned int ERRANY:1;                  /**< \brief [7:7] Any Read Access ECC Error (rh) */
    unsigned int BLANKD:1;                  /**< \brief [8:8] Read Access Blank Digital (rh) */
    unsigned int BLANKA:1;                  /**< \brief [9:9] Read Access Blank Analog (rh) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int AER1:1;                    /**< \brief [16:16] Accumulated Single Bit ECC Errors (rh) */
    unsigned int AER2:1;                    /**< \brief [17:17] Accumulated Double Bit ECC Errors (rh) */
    unsigned int AER3:1;                    /**< \brief [18:18] Accumulated Triple Bit ECC Errors (rh) */
    unsigned int AERM:1;                    /**< \brief [19:19] Accumulated Multi-bit ECC Errors (rh) */
    unsigned int reserved_20:3;             /**< \brief \internal Reserved */
    unsigned int AERANY:1;                  /**< \brief [23:23] Accumulated Any Read Access ECC Error (rh) */
    unsigned int ABLANKD:1;                 /**< \brief [24:24] Accumulated Blank Digital (rh) */
    unsigned int ABLANKA:1;                 /**< \brief [25:25] Accumulated Blank Analog (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_ECCS_Bits;

