Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  DF0 ECC Write Register */
typedef struct _Ifx_DMU_HF_ECCW_Bits
{
    unsigned int WCODE:22;                  /**< \brief [21:0] Error Correction Write Code (rw) */
    unsigned int reserved_22:6;             /**< \brief \internal Reserved */
    unsigned int PECENCDIS:2;               /**< \brief [29:28] PFLASH ECC Encoding Disable (rw) */
    unsigned int DECENCDIS:2;               /**< \brief [31:30] DFLASH ECC Encoding Disable (rw) */
} Ifx_DMU_HF_ECCW_Bits;

/** \brief  Enable Error Interrupt Control Register */
typedef struct _Ifx_DMU_HF_EER_Bits
{
    unsigned int OPERM:1;                   /**< \brief [0:0] Operation Error Interrupt Mask (rw) */
    unsigned int SQERM:1;                   /**< \brief [1:1] Command Sequence Error Interrupt Mask (rw) */
    unsigned int PROERM:1;                  /**< \brief [2:2] Protection Error Interrupt Mask (rw) */
    unsigned int PVERM:1;                   /**< \brief [3:3] Program Verify Error Interrupt Mask (rw) */
    unsigned int EVERM:1;                   /**< \brief [4:4] Erase Verify Error Interrupt Mask (rw) */
    unsigned int reserved_5:26;             /**< \brief \internal Reserved */
    unsigned int EOBM:1;                    /**< \brief [31:31] End of Busy Interrupt Mask (rw) */
} Ifx_DMU_HF_EER_Bits;

/** \brief  Error Status Register */
typedef struct _Ifx_DMU_HF_ERRSR_Bits
{
    unsigned int OPER:1;                    /**< \brief [0:0] Flash Operation Error (rh) */
    unsigned int SQER:1;                    /**< \brief [1:1] Command Sequence Error (rh) */
    unsigned int PROER:1;                   /**< \brief [2:2] Protection Error (rh) */
    unsigned int PVER:1;                    /**< \brief [3:3] Program Verify Error (rh) */
    unsigned int EVER:1;                    /**< \brief [4:4] Erase Verify Error (rh) */
    unsigned int ADER:1;                    /**< \brief [5:5] SRI Bus Address ECC Error (rh) */
    unsigned int ORIER:1;                   /**< \brief [6:6] Original Error (rh) */
    unsigned int PWRER:1;                   /**< \brief [7:7] EVR Primary Monitor Error (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_ERRSR_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_DMU_HF_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MOD_NUMBER:8;              /**< \brief [23:16] Module Number Value (r) */
    unsigned int FLASH_REV:8;               /**< \brief [31:24] Flash Revision (r) */
} Ifx_DMU_HF_ID_Bits;

/** \brief  Margin Control Register */
typedef struct _Ifx_DMU_HF_MARGIN_Bits
{
    unsigned int SELD0:2;                   /**< \brief [1:0] DF0 Margin Read Selection (rw) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int HMARGIN:1;                 /**< \brief [8:8] Hard Margin Selection (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_MARGIN_Bits;

/** \brief  Flash Operation Register */
typedef struct _Ifx_DMU_HF_OPERATION_Bits
{
    unsigned int PROG:1;                    /**< \brief [0:0] Programming State (rh) */
    unsigned int ERASE:1;                   /**< \brief [1:1] Erase State (rh) */
    unsigned int USER:1;                    /**< \brief [2:2] User State (rh) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int BOOTSTAT:3;                /**< \brief [10:8] FSI Boot Status (rh) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_DMU_HF_OPERATION_Bits;

/** \brief  Power Control Register */
typedef struct _Ifx_DMU_HF_PCONTROL_Bits
{
    unsigned int SLEEP:2;                   /**< \brief [1:0] Sleep Mode Control (rw) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int IDLE:2;                    /**< \brief [9:8] Dynamic Idle Enable (w) */
    unsigned int DEMAND:2;                  /**< \brief [11:10] Demand Enable (w) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int ESLDIS:2;                  /**< \brief [17:16] External Sleep Mode Request Disable (rw) */
    unsigned int reserved_18:12;            /**< \brief \internal Reserved */
    unsigned int PR5V:2;                    /**< \brief [31:30] Programming Supply 5V (rw) */
} Ifx_DMU_HF_PCONTROL_Bits;

/** \brief  Debug Interface Protection Configuration */
typedef struct _Ifx_DMU_HF_PROCONDBG_Bits
{
    unsigned int OCDSDIS:1;                 /**< \brief [0:0] OCDS Disabled (rh) */
    unsigned int DBGIFLCK:1;                /**< \brief [1:1] Debug Interface Locked (rh) */
    unsigned int EDM:2;                     /**< \brief [3:2] Entered Debug Mode (rh) */
    unsigned int UCB:4;                     /**< \brief [7:4] Reserved (rh) */
    unsigned int TIC:4;                     /**< \brief [11:8] Tool Interface Control (rh) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_DMU_HF_PROCONDBG_Bits;

/** \brief  DFLASH Protection Configuration */
typedef struct _Ifx_DMU_HF_PROCONDF_Bits
{
    unsigned int L:1;                       /**< \brief [0:0] DF0_HSM Locked for Write Protection (rh) */
    unsigned int reserved_1:7;              /**< \brief \internal Reserved */
    unsigned int OSCCFG:1;                  /**< \brief [8:8] OSC Configuration by SSW (rh) */
    unsigned int MODE:2;                    /**< \brief [10:9] OSC Mode (rh) */
    unsigned int APREN:1;                   /**< \brief [11:11] OSC Amplitude Regulation Enable (rh) */
    unsigned int CAP0EN:1;                  /**< \brief [12:12] OSC Capacitance 0 Enable (x=0-3) (rh) */
    unsigned int CAP1EN:1;                  /**< \brief [13:13] OSC Capacitance 1 Enable (x=0-3) (rh) */
    unsigned int CAP2EN:1;                  /**< \brief [14:14] OSC Capacitance 2 Enable (x=0-3) (rh) */
    unsigned int CAP3EN:1;                  /**< \brief [15:15] OSC Capacitance 3 Enable (x=0-3) (rh) */
    unsigned int ESR0CNT:12;                /**< \brief [27:16] ESR0 Prolongation Counter (rh) */
    unsigned int UCB:3;                     /**< \brief [30:28] Reserved (rh) */
    unsigned int RPRO:1;                    /**< \brief [31:31] Read Protection Configuration (rh) */
} Ifx_DMU_HF_PROCONDF_Bits;


