Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  PFLASH Protection Configuration */
typedef struct _Ifx_DMU_HF_PROCONPF_Bits
{
    unsigned int UCB:31;                    /**< \brief [30:0] Reserved for UCB (rh) */
    unsigned int RPRO:1;                    /**< \brief [31:31] Read Protection Configuration (rh) */
} Ifx_DMU_HF_PROCONPF_Bits;

/** \brief  RAM Configuration */
typedef struct _Ifx_DMU_HF_PROCONRAM_Bits
{
    unsigned int RAMIN:2;                   /**< \brief [1:0] RAM Initialization by SSW Control (rh) */
    unsigned int UCB:14;                    /**< \brief [15:2] Reserved (rh) */
    unsigned int RAMINSEL:6;                /**< \brief [21:16] RAM Initialization Selection (rh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int LMUINSEL:7;                /**< \brief [30:24] LMU Initialization Selection (rh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_PROCONRAM_Bits;

/** \brief  Tuning Protection Configuration */
typedef struct _Ifx_DMU_HF_PROCONTP_Bits
{
    unsigned int TP:1;                      /**< \brief [0:0] Tuning Protection (rh) */
    unsigned int UCB:7;                     /**< \brief [7:1] Reserved for UCB (rh) */
    unsigned int BML:2;                     /**< \brief [9:8] Boot Mode Lock (rh) */
    unsigned int reserved_10:22;            /**< \brief \internal Reserved */
} Ifx_DMU_HF_PROCONTP_Bits;

/** \brief  DF0 User Mode Control */
typedef struct _Ifx_DMU_HF_PROCONUSR_Bits
{
    unsigned int MODE:2;                    /**< \brief [1:0] DF0 User Mode Control (rh) */
    unsigned int UCB:30;                    /**< \brief [31:2] Reserved for UCB (rh) */
} Ifx_DMU_HF_PROCONUSR_Bits;

/** \brief  Flash Protection Status Register */
typedef struct _Ifx_DMU_HF_PROTECT_Bits
{
    unsigned int PRODISP:1;                 /**< \brief [0:0] PFLASH Protection Disabled (rh) */
    unsigned int PRODISD:1;                 /**< \brief [1:1] DFLASH Protection Disabled (rh) */
    unsigned int PRODISDBG:1;               /**< \brief [2:2] Debug Interface Password Protection Disabled (rh) */
    unsigned int reserved_3:21;             /**< \brief \internal Reserved */
    unsigned int SRT:1;                     /**< \brief [24:24] Secure Retest Password Protection Disabled (rh) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_PROTECT_Bits;

/** \brief  PFLASH Bank Size Configuration Register */
typedef struct _Ifx_DMU_HF_PSIZE_Bits
{
    unsigned int reserved_0:6;              /**< \brief \internal Reserved */
    unsigned int SIZE:2;                    /**< \brief [7:6] Size of Program Flash Bank PFp (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_PSIZE_Bits;

/** \brief  Power Status Register */
typedef struct _Ifx_DMU_HF_PSTATUS_Bits
{
    unsigned int SLEEP:1;                   /**< \brief [0:0] Sleep Mode (rh) */
    unsigned int IDLE:1;                    /**< \brief [1:1] Dynamic Idle (rh) */
    unsigned int DEMAND:1;                  /**< \brief [2:2] Demand (rh) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_PSTATUS_Bits;

/** \brief  PFLASH Wait Cycle Register */
typedef struct _Ifx_DMU_HF_PWAIT_Bits
{
    unsigned int RFLASH:6;                  /**< \brief [5:0] Operation Mode (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int RECC:3;                    /**< \brief [10:8] Operation Mode (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int CFLASH:6;                  /**< \brief [21:16] Cranking Mode (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int CECC:3;                    /**< \brief [26:24] Cranking Mode (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_PWAIT_Bits;

/** \brief  Flash Status Register */
typedef struct _Ifx_DMU_HF_STATUS_Bits
{
    unsigned int D0BUSY:1;                  /**< \brief [0:0] Data Flash Bank 0 Busy (rh) */
    unsigned int D1BUSY:1;                  /**< \brief [1:1] Data Flash Bank 1 Busy (rh) */
    unsigned int P0BUSY:1;                  /**< \brief [2:2] Program Flash PF0 Busy (rh) */
    unsigned int P1BUSY:1;                  /**< \brief [3:3] Program Flash PF1 Busy (rh) */
    unsigned int P2BUSY:1;                  /**< \brief [4:4] Program Flash PF2 Busy (rh) */
    unsigned int P3BUSY:1;                  /**< \brief [5:5] Program Flash PF3 Busy (rh) */
    unsigned int P4BUSY:1;                  /**< \brief [6:6] Program Flash PF4 Busy (rh) */
    unsigned int P5BUSY:1;                  /**< \brief [7:7] Program Flash PF5 Busy (rh) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int FABUSY:1;                  /**< \brief [16:16] Flash Array Busy (rh) */
    unsigned int FLW:1;                     /**< \brief [17:17] Flash Wafer State (rh) */
    unsigned int FLU:1;                     /**< \brief [18:18] Flash Unlocked State (rh) */
    unsigned int FLR:1;                     /**< \brief [19:19] Flash Delivery State (rh) */
    unsigned int DFPAGE:1;                  /**< \brief [20:20] Data Flash in Page Mode (rh) */
    unsigned int PFPAGE:1;                  /**< \brief [21:21] Program Flash in Page Mode (rh) */
    unsigned int FRET:1;                    /**< \brief [22:22] Field Return (rh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int CFS:2;                     /**< \brief [25:24] Configuration Sector Confirmation (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_DMU_HF_STATUS_Bits;

/** \brief  Suspend Control Register */
typedef struct _Ifx_DMU_HF_SUSPEND_Bits
{
    unsigned int REQ:1;                     /**< \brief [0:0] Suspend Request (rwh) */
    unsigned int CLR:1;                     /**< \brief [1:1] Suspend Clear (w) */
    unsigned int reserved_2:14;             /**< \brief \internal Reserved */
    unsigned int SPND:1;                    /**< \brief [16:16] Flash Operation Suspended (rh) */
    unsigned int ERR:1;                     /**< \brief [17:17] Suspend Error (rh) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_DMU_HF_SUSPEND_Bits;

/** \brief  PFLASH Bank OTP Protection Configuration 0 */
typedef struct _Ifx_DMU_HP_PROCON_OTP0_Bits
{
    unsigned int S0ROM:1;                   /**< \brief [0:0] PFLASH p Sector 0 Locked for Forever (rh) */
    unsigned int S1ROM:1;                   /**< \brief [1:1] PFLASH p Sector 1 Locked for Forever (rh) */
    unsigned int S2ROM:1;                   /**< \brief [2:2] PFLASH p Sector 2 Locked for Forever (rh) */
    unsigned int S3ROM:1;                   /**< \brief [3:3] PFLASH p Sector 3 Locked for Forever (rh) */
    unsigned int S4ROM:1;                   /**< \brief [4:4] PFLASH p Sector 4 Locked for Forever (rh) */
    unsigned int S5ROM:1;                   /**< \brief [5:5] PFLASH p Sector 5 Locked for Forever (rh) */
    unsigned int S6ROM:1;                   /**< \brief [6:6] PFLASH p Sector 6 Locked for Forever (rh) */
    unsigned int S7ROM:1;                   /**< \brief [7:7] PFLASH p Sector 7 Locked for Forever (rh) */
    unsigned int S8ROM:1;                   /**< \brief [8:8] PFLASH p Sector 8 Locked for Forever (rh) */
    unsigned int S9ROM:1;                   /**< \brief [9:9] PFLASH p Sector 9 Locked for Forever (rh) */
    unsigned int S10ROM:1;                  /**< \brief [10:10] PFLASH p Sector 10 Locked for Forever (rh) */
    unsigned int S11ROM:1;                  /**< \brief [11:11] PFLASH p Sector 11 Locked for Forever (rh) */
    unsigned int S12ROM:1;                  /**< \brief [12:12] PFLASH p Sector 12 Locked for Forever (rh) */
    unsigned int S13ROM:1;                  /**< \brief [13:13] PFLASH p Sector 13 Locked for Forever (rh) */
    unsigned int S14ROM:1;                  /**< \brief [14:14] PFLASH p Sector 14 Locked for Forever (rh) */
    unsigned int S15ROM:1;                  /**< \brief [15:15] PFLASH p Sector 15 Locked for Forever (rh) */
    unsigned int S16ROM:1;                  /**< \brief [16:16] PFLASH p Sector 16 Locked for Forever (rh) */
    unsigned int S17ROM:1;                  /**< \brief [17:17] PFLASH p Sector 17 Locked for Forever (rh) */
    unsigned int S18ROM:1;                  /**< \brief [18:18] PFLASH p Sector 18 Locked for Forever (rh) */
    unsigned int S19ROM:1;                  /**< \brief [19:19] PFLASH p Sector 19 Locked for Forever (rh) */
    unsigned int S20ROM:1;                  /**< \brief [20:20] PFLASH p Sector 20 Locked for Forever (rh) */
    unsigned int S21ROM:1;                  /**< \brief [21:21] PFLASH p Sector 21 Locked for Forever (rh) */
    unsigned int S22ROM:1;                  /**< \brief [22:22] PFLASH p Sector 22 Locked for Forever (rh) */
    unsigned int S23ROM:1;                  /**< \brief [23:23] PFLASH p Sector 23 Locked for Forever (rh) */
    unsigned int S24ROM:1;                  /**< \brief [24:24] PFLASH p Sector 24 Locked for Forever (rh) */
    unsigned int S25ROM:1;                  /**< \brief [25:25] PFLASH p Sector 25 Locked for Forever (rh) */
    unsigned int S26ROM:1;                  /**< \brief [26:26] PFLASH p Sector 26 Locked for Forever (rh) */
    unsigned int S27ROM:1;                  /**< \brief [27:27] PFLASH p Sector 27 Locked for Forever (rh) */
    unsigned int S28ROM:1;                  /**< \brief [28:28] PFLASH p Sector 28 Locked for Forever (rh) */
    unsigned int S29ROM:1;                  /**< \brief [29:29] PFLASH p Sector 29 Locked for Forever (rh) */
    unsigned int S30ROM:1;                  /**< \brief [30:30] PFLASH p Sector 30 Locked for Forever (rh) */
    unsigned int S31ROM:1;                  /**< \brief [31:31] PFLASH p Sector 31 Locked for Forever (rh) */
} Ifx_DMU_HP_PROCON_OTP0_Bits;

/** \brief  PFLASH Bank OTP Protection Configuration 1 */
typedef struct _Ifx_DMU_HP_PROCON_OTP1_Bits
{
    unsigned int S32ROM:1;                  /**< \brief [0:0] PFLASH p Sector 32 Locked for Forever (rh) */
    unsigned int S33ROM:1;                  /**< \brief [1:1] PFLASH p Sector 33 Locked for Forever (rh) */
    unsigned int S34ROM:1;                  /**< \brief [2:2] PFLASH p Sector 34 Locked for Forever (rh) */
    unsigned int S35ROM:1;                  /**< \brief [3:3] PFLASH p Sector 35 Locked for Forever (rh) */
    unsigned int S36ROM:1;                  /**< \brief [4:4] PFLASH p Sector 36 Locked for Forever (rh) */
    unsigned int S37ROM:1;                  /**< \brief [5:5] PFLASH p Sector 37 Locked for Forever (rh) */
    unsigned int S38ROM:1;                  /**< \brief [6:6] PFLASH p Sector 38 Locked for Forever (rh) */
    unsigned int S39ROM:1;                  /**< \brief [7:7] PFLASH p Sector 39 Locked for Forever (rh) */
    unsigned int S40ROM:1;                  /**< \brief [8:8] PFLASH p Sector 40 Locked for Forever (rh) */
    unsigned int S41ROM:1;                  /**< \brief [9:9] PFLASH p Sector 41 Locked for Forever (rh) */
    unsigned int S42ROM:1;                  /**< \brief [10:10] PFLASH p Sector 42 Locked for Forever (rh) */
    unsigned int S43ROM:1;                  /**< \brief [11:11] PFLASH p Sector 43 Locked for Forever (rh) */
    unsigned int S44ROM:1;                  /**< \brief [12:12] PFLASH p Sector 44 Locked for Forever (rh) */
    unsigned int S45ROM:1;                  /**< \brief [13:13] PFLASH p Sector 45 Locked for Forever (rh) */
    unsigned int S46ROM:1;                  /**< \brief [14:14] PFLASH p Sector 46 Locked for Forever (rh) */
    unsigned int S47ROM:1;                  /**< \brief [15:15] PFLASH p Sector 47 Locked for Forever (rh) */
    unsigned int S48ROM:1;                  /**< \brief [16:16] PFLASH p Sector 48 Locked for Forever (rh) */
    unsigned int S49ROM:1;                  /**< \brief [17:17] PFLASH p Sector 49 Locked for Forever (rh) */
    unsigned int S50ROM:1;                  /**< \brief [18:18] PFLASH p Sector 50 Locked for Forever (rh) */
    unsigned int S51ROM:1;                  /**< \brief [19:19] PFLASH p Sector 51 Locked for Forever (rh) */
    unsigned int S52ROM:1;                  /**< \brief [20:20] PFLASH p Sector 52 Locked for Forever (rh) */
    unsigned int S53ROM:1;                  /**< \brief [21:21] PFLASH p Sector 53 Locked for Forever (rh) */
    unsigned int S54ROM:1;                  /**< \brief [22:22] PFLASH p Sector 54 Locked for Forever (rh) */
    unsigned int S55ROM:1;                  /**< \brief [23:23] PFLASH p Sector 55 Locked for Forever (rh) */
    unsigned int S56ROM:1;                  /**< \brief [24:24] PFLASH p Sector 56 Locked for Forever (rh) */
    unsigned int S57ROM:1;                  /**< \brief [25:25] PFLASH p Sector 57 Locked for Forever (rh) */
    unsigned int S58ROM:1;                  /**< \brief [26:26] PFLASH p Sector 58 Locked for Forever (rh) */
    unsigned int S59ROM:1;                  /**< \brief [27:27] PFLASH p Sector 59 Locked for Forever (rh) */
    unsigned int S60ROM:1;                  /**< \brief [28:28] PFLASH p Sector 60 Locked for Forever (rh) */
    unsigned int S61ROM:1;                  /**< \brief [29:29] PFLASH p Sector 61 Locked for Forever (rh) */
    unsigned int S62ROM:1;                  /**< \brief [30:30] PFLASH p Sector 62 Locked for Forever (rh) */
    unsigned int S63ROM:1;                  /**< \brief [31:31] PFLASH p Sector 63 Locked for Forever (rh) */
} Ifx_DMU_HP_PROCON_OTP1_Bits;

/** \brief  PFLASH Bank OTP Protection Configuration 2 */
typedef struct _Ifx_DMU_HP_PROCON_OTP2_Bits
{
    unsigned int S64ROM:1;                  /**< \brief [0:0] PFLASH p Sector 64 Locked for Forever (rh) */
    unsigned int S65ROM:1;                  /**< \brief [1:1] PFLASH p Sector 65 Locked for Forever (rh) */
    unsigned int S66ROM:1;                  /**< \brief [2:2] PFLASH p Sector 66 Locked for Forever (rh) */
    unsigned int S67ROM:1;                  /**< \brief [3:3] PFLASH p Sector 67 Locked for Forever (rh) */
    unsigned int S68ROM:1;                  /**< \brief [4:4] PFLASH p Sector 68 Locked for Forever (rh) */
    unsigned int S69ROM:1;                  /**< \brief [5:5] PFLASH p Sector 69 Locked for Forever (rh) */
    unsigned int S70ROM:1;                  /**< \brief [6:6] PFLASH p Sector 70 Locked for Forever (rh) */
    unsigned int S71ROM:1;                  /**< \brief [7:7] PFLASH p Sector 71 Locked for Forever (rh) */
    unsigned int S72ROM:1;                  /**< \brief [8:8] PFLASH p Sector 72 Locked for Forever (rh) */
    unsigned int S73ROM:1;                  /**< \brief [9:9] PFLASH p Sector 73 Locked for Forever (rh) */
    unsigned int S74ROM:1;                  /**< \brief [10:10] PFLASH p Sector 74 Locked for Forever (rh) */
    unsigned int S75ROM:1;                  /**< \brief [11:11] PFLASH p Sector 75 Locked for Forever (rh) */
    unsigned int S76ROM:1;                  /**< \brief [12:12] PFLASH p Sector 76 Locked for Forever (rh) */
    unsigned int S77ROM:1;                  /**< \brief [13:13] PFLASH p Sector 77 Locked for Forever (rh) */
    unsigned int S78ROM:1;                  /**< \brief [14:14] PFLASH p Sector 78 Locked for Forever (rh) */
    unsigned int S79ROM:1;                  /**< \brief [15:15] PFLASH p Sector 79 Locked for Forever (rh) */
    unsigned int S80ROM:1;                  /**< \brief [16:16] PFLASH p Sector 80 Locked for Forever (rh) */
    unsigned int S81ROM:1;                  /**< \brief [17:17] PFLASH p Sector 81 Locked for Forever (rh) */
    unsigned int S82ROM:1;                  /**< \brief [18:18] PFLASH p Sector 82 Locked for Forever (rh) */
    unsigned int S83ROM:1;                  /**< \brief [19:19] PFLASH p Sector 83 Locked for Forever (rh) */
    unsigned int S84ROM:1;                  /**< \brief [20:20] PFLASH p Sector 84 Locked for Forever (rh) */
    unsigned int S85ROM:1;                  /**< \brief [21:21] PFLASH p Sector 85 Locked for Forever (rh) */
    unsigned int S86ROM:1;                  /**< \brief [22:22] PFLASH p Sector 86 Locked for Forever (rh) */
    unsigned int S87ROM:1;                  /**< \brief [23:23] PFLASH p Sector 87 Locked for Forever (rh) */
    unsigned int S88ROM:1;                  /**< \brief [24:24] PFLASH p Sector 88 Locked for Forever (rh) */
    unsigned int S89ROM:1;                  /**< \brief [25:25] PFLASH p Sector 89 Locked for Forever (rh) */
    unsigned int S90ROM:1;                  /**< \brief [26:26] PFLASH p Sector 90 Locked for Forever (rh) */
    unsigned int S91ROM:1;                  /**< \brief [27:27] PFLASH p Sector 91 Locked for Forever (rh) */
    unsigned int S92ROM:1;                  /**< \brief [28:28] PFLASH p Sector 92 Locked for Forever (rh) */
    unsigned int S93ROM:1;                  /**< \brief [29:29] PFLASH p Sector 93 Locked for Forever (rh) */
    unsigned int S94ROM:1;                  /**< \brief [30:30] PFLASH p Sector 94 Locked for Forever (rh) */
    unsigned int S95ROM:1;                  /**< \brief [31:31] PFLASH p Sector 95 Locked for Forever (rh) */
} Ifx_DMU_HP_PROCON_OTP2_Bits;

