Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  PFLASH Bank OTP Protection Configuration 3 */
typedef struct _Ifx_DMU_HP_PROCON_OTP3_Bits
{
    unsigned int S96ROM:1;                  /**< \brief [0:0] PFLASH p Sector 96 Locked for Forever (rh) */
    unsigned int S97ROM:1;                  /**< \brief [1:1] PFLASH p Sector 97 Locked for Forever (rh) */
    unsigned int S98ROM:1;                  /**< \brief [2:2] PFLASH p Sector 98 Locked for Forever (rh) */
    unsigned int S99ROM:1;                  /**< \brief [3:3] PFLASH p Sector 99 Locked for Forever (rh) */
    unsigned int S100ROM:1;                 /**< \brief [4:4] PFLASH p Sector 100 Locked for Forever (rh) */
    unsigned int S101ROM:1;                 /**< \brief [5:5] PFLASH p Sector 101 Locked for Forever (rh) */
    unsigned int S102ROM:1;                 /**< \brief [6:6] PFLASH p Sector 102 Locked for Forever (rh) */
    unsigned int S103ROM:1;                 /**< \brief [7:7] PFLASH p Sector 103 Locked for Forever (rh) */
    unsigned int S104ROM:1;                 /**< \brief [8:8] PFLASH p Sector 104 Locked for Forever (rh) */
    unsigned int S105ROM:1;                 /**< \brief [9:9] PFLASH p Sector 105 Locked for Forever (rh) */
    unsigned int S106ROM:1;                 /**< \brief [10:10] PFLASH p Sector 106 Locked for Forever (rh) */
    unsigned int S107ROM:1;                 /**< \brief [11:11] PFLASH p Sector 107 Locked for Forever (rh) */
    unsigned int S108ROM:1;                 /**< \brief [12:12] PFLASH p Sector 108 Locked for Forever (rh) */
    unsigned int S109ROM:1;                 /**< \brief [13:13] PFLASH p Sector 109 Locked for Forever (rh) */
    unsigned int S110ROM:1;                 /**< \brief [14:14] PFLASH p Sector 110 Locked for Forever (rh) */
    unsigned int S111ROM:1;                 /**< \brief [15:15] PFLASH p Sector 111 Locked for Forever (rh) */
    unsigned int S112ROM:1;                 /**< \brief [16:16] PFLASH p Sector 112 Locked for Forever (rh) */
    unsigned int S113ROM:1;                 /**< \brief [17:17] PFLASH p Sector 113 Locked for Forever (rh) */
    unsigned int S114ROM:1;                 /**< \brief [18:18] PFLASH p Sector 114 Locked for Forever (rh) */
    unsigned int S115ROM:1;                 /**< \brief [19:19] PFLASH p Sector 115 Locked for Forever (rh) */
    unsigned int S116ROM:1;                 /**< \brief [20:20] PFLASH p Sector 116 Locked for Forever (rh) */
    unsigned int S117ROM:1;                 /**< \brief [21:21] PFLASH p Sector 117 Locked for Forever (rh) */
    unsigned int S118ROM:1;                 /**< \brief [22:22] PFLASH p Sector 118 Locked for Forever (rh) */
    unsigned int S119ROM:1;                 /**< \brief [23:23] PFLASH p Sector 119 Locked for Forever (rh) */
    unsigned int S120ROM:1;                 /**< \brief [24:24] PFLASH p Sector 120 Locked for Forever (rh) */
    unsigned int S121ROM:1;                 /**< \brief [25:25] PFLASH p Sector 121 Locked for Forever (rh) */
    unsigned int S122ROM:1;                 /**< \brief [26:26] PFLASH p Sector 122 Locked for Forever (rh) */
    unsigned int S123ROM:1;                 /**< \brief [27:27] PFLASH p Sector 123 Locked for Forever (rh) */
    unsigned int S124ROM:1;                 /**< \brief [28:28] PFLASH p Sector 124 Locked for Forever (rh) */
    unsigned int S125ROM:1;                 /**< \brief [29:29] PFLASH p Sector 125 Locked for Forever (rh) */
    unsigned int S126ROM:1;                 /**< \brief [30:30] PFLASH p Sector 126 Locked for Forever (rh) */
    unsigned int S127ROM:1;                 /**< \brief [31:31] PFLASH p Sector 127 Locked for Forever (rh) */
} Ifx_DMU_HP_PROCON_OTP3_Bits;

/** \brief  PFLASH Bank OTP Protection Configuration 4 */
typedef struct _Ifx_DMU_HP_PROCON_OTP4_Bits
{
    unsigned int S128ROM:1;                 /**< \brief [0:0] PFLASH p Sector 128 Locked for Forever (rh) */
    unsigned int S129ROM:1;                 /**< \brief [1:1] PFLASH p Sector 129 Locked for Forever (rh) */
    unsigned int S130ROM:1;                 /**< \brief [2:2] PFLASH p Sector 130 Locked for Forever (rh) */
    unsigned int S131ROM:1;                 /**< \brief [3:3] PFLASH p Sector 131 Locked for Forever (rh) */
    unsigned int S132ROM:1;                 /**< \brief [4:4] PFLASH p Sector 132 Locked for Forever (rh) */
    unsigned int S133ROM:1;                 /**< \brief [5:5] PFLASH p Sector 133 Locked for Forever (rh) */
    unsigned int S134ROM:1;                 /**< \brief [6:6] PFLASH p Sector 134 Locked for Forever (rh) */
    unsigned int S135ROM:1;                 /**< \brief [7:7] PFLASH p Sector 135 Locked for Forever (rh) */
    unsigned int S136ROM:1;                 /**< \brief [8:8] PFLASH p Sector 136 Locked for Forever (rh) */
    unsigned int S137ROM:1;                 /**< \brief [9:9] PFLASH p Sector 137 Locked for Forever (rh) */
    unsigned int S138ROM:1;                 /**< \brief [10:10] PFLASH p Sector 138 Locked for Forever (rh) */
    unsigned int S139ROM:1;                 /**< \brief [11:11] PFLASH p Sector 139 Locked for Forever (rh) */
    unsigned int S140ROM:1;                 /**< \brief [12:12] PFLASH p Sector 140 Locked for Forever (rh) */
    unsigned int S141ROM:1;                 /**< \brief [13:13] PFLASH p Sector 141 Locked for Forever (rh) */
    unsigned int S142ROM:1;                 /**< \brief [14:14] PFLASH p Sector 142 Locked for Forever (rh) */
    unsigned int S143ROM:1;                 /**< \brief [15:15] PFLASH p Sector 143 Locked for Forever (rh) */
    unsigned int S144ROM:1;                 /**< \brief [16:16] PFLASH p Sector 144 Locked for Forever (rh) */
    unsigned int S145ROM:1;                 /**< \brief [17:17] PFLASH p Sector 145 Locked for Forever (rh) */
    unsigned int S146ROM:1;                 /**< \brief [18:18] PFLASH p Sector 146 Locked for Forever (rh) */
    unsigned int S147ROM:1;                 /**< \brief [19:19] PFLASH p Sector 147 Locked for Forever (rh) */
    unsigned int S148ROM:1;                 /**< \brief [20:20] PFLASH p Sector 148 Locked for Forever (rh) */
    unsigned int S149ROM:1;                 /**< \brief [21:21] PFLASH p Sector 149 Locked for Forever (rh) */
    unsigned int S150ROM:1;                 /**< \brief [22:22] PFLASH p Sector 150 Locked for Forever (rh) */
    unsigned int S151ROM:1;                 /**< \brief [23:23] PFLASH p Sector 151 Locked for Forever (rh) */
    unsigned int S152ROM:1;                 /**< \brief [24:24] PFLASH p Sector 152 Locked for Forever (rh) */
    unsigned int S153ROM:1;                 /**< \brief [25:25] PFLASH p Sector 153 Locked for Forever (rh) */
    unsigned int S154ROM:1;                 /**< \brief [26:26] PFLASH p Sector 154 Locked for Forever (rh) */
    unsigned int S155ROM:1;                 /**< \brief [27:27] PFLASH p Sector 155 Locked for Forever (rh) */
    unsigned int S156ROM:1;                 /**< \brief [28:28] PFLASH p Sector 156 Locked for Forever (rh) */
    unsigned int S157ROM:1;                 /**< \brief [29:29] PFLASH p Sector 157 Locked for Forever (rh) */
    unsigned int S158ROM:1;                 /**< \brief [30:30] PFLASH p Sector 158 Locked for Forever (rh) */
    unsigned int S159ROM:1;                 /**< \brief [31:31] PFLASH p Sector 159 Locked for Forever (rh) */
} Ifx_DMU_HP_PROCON_OTP4_Bits;

