Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  PFLASH Bank OTP Protection Configuration 5 */
typedef struct _Ifx_DMU_HP_PROCON_OTP5_Bits
{
    unsigned int S160ROM:1;                 /**< \brief [0:0] PFLASH p Sector 160 Locked for Forever (rh) */
    unsigned int S161ROM:1;                 /**< \brief [1:1] PFLASH p Sector 161 Locked for Forever (rh) */
    unsigned int S162ROM:1;                 /**< \brief [2:2] PFLASH p Sector 162 Locked for Forever (rh) */
    unsigned int S163ROM:1;                 /**< \brief [3:3] PFLASH p Sector 163 Locked for Forever (rh) */
    unsigned int S164ROM:1;                 /**< \brief [4:4] PFLASH p Sector 164 Locked for Forever (rh) */
    unsigned int S165ROM:1;                 /**< \brief [5:5] PFLASH p Sector 165 Locked for Forever (rh) */
    unsigned int S166ROM:1;                 /**< \brief [6:6] PFLASH p Sector 166 Locked for Forever (rh) */
    unsigned int S167ROM:1;                 /**< \brief [7:7] PFLASH p Sector 167 Locked for Forever (rh) */
    unsigned int S168ROM:1;                 /**< \brief [8:8] PFLASH p Sector 168 Locked for Forever (rh) */
    unsigned int S169ROM:1;                 /**< \brief [9:9] PFLASH p Sector 169 Locked for Forever (rh) */
    unsigned int S170ROM:1;                 /**< \brief [10:10] PFLASH p Sector 170 Locked for Forever (rh) */
    unsigned int S171ROM:1;                 /**< \brief [11:11] PFLASH p Sector 171 Locked for Forever (rh) */
    unsigned int S172ROM:1;                 /**< \brief [12:12] PFLASH p Sector 172 Locked for Forever (rh) */
    unsigned int S173ROM:1;                 /**< \brief [13:13] PFLASH p Sector 173 Locked for Forever (rh) */
    unsigned int S174ROM:1;                 /**< \brief [14:14] PFLASH p Sector 174 Locked for Forever (rh) */
    unsigned int S175ROM:1;                 /**< \brief [15:15] PFLASH p Sector 175 Locked for Forever (rh) */
    unsigned int S176ROM:1;                 /**< \brief [16:16] PFLASH p Sector 176 Locked for Forever (rh) */
    unsigned int S177ROM:1;                 /**< \brief [17:17] PFLASH p Sector 177 Locked for Forever (rh) */
    unsigned int S178ROM:1;                 /**< \brief [18:18] PFLASH p Sector 178 Locked for Forever (rh) */
    unsigned int S179ROM:1;                 /**< \brief [19:19] PFLASH p Sector 179 Locked for Forever (rh) */
    unsigned int S180ROM:1;                 /**< \brief [20:20] PFLASH p Sector 180 Locked for Forever (rh) */
    unsigned int S181ROM:1;                 /**< \brief [21:21] PFLASH p Sector 181 Locked for Forever (rh) */
    unsigned int S182ROM:1;                 /**< \brief [22:22] PFLASH p Sector 182 Locked for Forever (rh) */
    unsigned int S183ROM:1;                 /**< \brief [23:23] PFLASH p Sector 183 Locked for Forever (rh) */
    unsigned int S184ROM:1;                 /**< \brief [24:24] PFLASH p Sector 184 Locked for Forever (rh) */
    unsigned int S185ROM:1;                 /**< \brief [25:25] PFLASH p Sector 185 Locked for Forever (rh) */
    unsigned int S186ROM:1;                 /**< \brief [26:26] PFLASH p Sector 186 Locked for Forever (rh) */
    unsigned int S187ROM:1;                 /**< \brief [27:27] PFLASH p Sector 187 Locked for Forever (rh) */
    unsigned int S188ROM:1;                 /**< \brief [28:28] PFLASH p Sector 188 Locked for Forever (rh) */
    unsigned int S189ROM:1;                 /**< \brief [29:29] PFLASH p Sector 189 Locked for Forever (rh) */
    unsigned int S190ROM:1;                 /**< \brief [30:30] PFLASH p Sector 190 Locked for Forever (rh) */
    unsigned int S191ROM:1;                 /**< \brief [31:31] PFLASH p Sector 191 Locked for Forever (rh) */
} Ifx_DMU_HP_PROCON_OTP5_Bits;

/** \brief  PFLASH Bank Protection Configuration 0 */
typedef struct _Ifx_DMU_HP_PROCON_P0_Bits
{
    unsigned int S0L:1;                     /**< \brief [0:0] PFLASH p Sector 0 Locked for Write Protection (rh) */
    unsigned int S1L:1;                     /**< \brief [1:1] PFLASH p Sector 1 Locked for Write Protection (rh) */
    unsigned int S2L:1;                     /**< \brief [2:2] PFLASH p Sector 2 Locked for Write Protection (rh) */
    unsigned int S3L:1;                     /**< \brief [3:3] PFLASH p Sector 3 Locked for Write Protection (rh) */
    unsigned int S4L:1;                     /**< \brief [4:4] PFLASH p Sector 4 Locked for Write Protection (rh) */
    unsigned int S5L:1;                     /**< \brief [5:5] PFLASH p Sector 5 Locked for Write Protection (rh) */
    unsigned int S6L:1;                     /**< \brief [6:6] PFLASH p Sector 6 Locked for Write Protection (rh) */
    unsigned int S7L:1;                     /**< \brief [7:7] PFLASH p Sector 7 Locked for Write Protection (rh) */
    unsigned int S8L:1;                     /**< \brief [8:8] PFLASH p Sector 8 Locked for Write Protection (rh) */
    unsigned int S9L:1;                     /**< \brief [9:9] PFLASH p Sector 9 Locked for Write Protection (rh) */
    unsigned int S10L:1;                    /**< \brief [10:10] PFLASH p Sector 10 Locked for Write Protection (rh) */
    unsigned int S11L:1;                    /**< \brief [11:11] PFLASH p Sector 11 Locked for Write Protection (rh) */
    unsigned int S12L:1;                    /**< \brief [12:12] PFLASH p Sector 12 Locked for Write Protection (rh) */
    unsigned int S13L:1;                    /**< \brief [13:13] PFLASH p Sector 13 Locked for Write Protection (rh) */
    unsigned int S14L:1;                    /**< \brief [14:14] PFLASH p Sector 14 Locked for Write Protection (rh) */
    unsigned int S15L:1;                    /**< \brief [15:15] PFLASH p Sector 15 Locked for Write Protection (rh) */
    unsigned int S16L:1;                    /**< \brief [16:16] PFLASH p Sector 16 Locked for Write Protection (rh) */
    unsigned int S17L:1;                    /**< \brief [17:17] PFLASH p Sector 17 Locked for Write Protection (rh) */
    unsigned int S18L:1;                    /**< \brief [18:18] PFLASH p Sector 18 Locked for Write Protection (rh) */
    unsigned int S19L:1;                    /**< \brief [19:19] PFLASH p Sector 19 Locked for Write Protection (rh) */
    unsigned int S20L:1;                    /**< \brief [20:20] PFLASH p Sector 20 Locked for Write Protection (rh) */
    unsigned int S21L:1;                    /**< \brief [21:21] PFLASH p Sector 21 Locked for Write Protection (rh) */
    unsigned int S22L:1;                    /**< \brief [22:22] PFLASH p Sector 22 Locked for Write Protection (rh) */
    unsigned int S23L:1;                    /**< \brief [23:23] PFLASH p Sector 23 Locked for Write Protection (rh) */
    unsigned int S24L:1;                    /**< \brief [24:24] PFLASH p Sector 24 Locked for Write Protection (rh) */
    unsigned int S25L:1;                    /**< \brief [25:25] PFLASH p Sector 25 Locked for Write Protection (rh) */
    unsigned int S26L:1;                    /**< \brief [26:26] PFLASH p Sector 26 Locked for Write Protection (rh) */
    unsigned int S27L:1;                    /**< \brief [27:27] PFLASH p Sector 27 Locked for Write Protection (rh) */
    unsigned int S28L:1;                    /**< \brief [28:28] PFLASH p Sector 28 Locked for Write Protection (rh) */
    unsigned int S29L:1;                    /**< \brief [29:29] PFLASH p Sector 29 Locked for Write Protection (rh) */
    unsigned int S30L:1;                    /**< \brief [30:30] PFLASH p Sector 30 Locked for Write Protection (rh) */
    unsigned int S31L:1;                    /**< \brief [31:31] PFLASH p Sector 31 Locked for Write Protection (rh) */
} Ifx_DMU_HP_PROCON_P0_Bits;

