Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  PFLASH Bank Protection Configuration 1 */
typedef struct _Ifx_DMU_HP_PROCON_P1_Bits
{
    unsigned int S32L:1;                    /**< \brief [0:0] PFLASH p Sector 32 Locked for Write Protection (rh) */
    unsigned int S33L:1;                    /**< \brief [1:1] PFLASH p Sector 33 Locked for Write Protection (rh) */
    unsigned int S34L:1;                    /**< \brief [2:2] PFLASH p Sector 34 Locked for Write Protection (rh) */
    unsigned int S35L:1;                    /**< \brief [3:3] PFLASH p Sector 35 Locked for Write Protection (rh) */
    unsigned int S36L:1;                    /**< \brief [4:4] PFLASH p Sector 36 Locked for Write Protection (rh) */
    unsigned int S37L:1;                    /**< \brief [5:5] PFLASH p Sector 37 Locked for Write Protection (rh) */
    unsigned int S38L:1;                    /**< \brief [6:6] PFLASH p Sector 38 Locked for Write Protection (rh) */
    unsigned int S39L:1;                    /**< \brief [7:7] PFLASH p Sector 39 Locked for Write Protection (rh) */
    unsigned int S40L:1;                    /**< \brief [8:8] PFLASH p Sector 40 Locked for Write Protection (rh) */
    unsigned int S41L:1;                    /**< \brief [9:9] PFLASH p Sector 41 Locked for Write Protection (rh) */
    unsigned int S42L:1;                    /**< \brief [10:10] PFLASH p Sector 42 Locked for Write Protection (rh) */
    unsigned int S43L:1;                    /**< \brief [11:11] PFLASH p Sector 43 Locked for Write Protection (rh) */
    unsigned int S44L:1;                    /**< \brief [12:12] PFLASH p Sector 44 Locked for Write Protection (rh) */
    unsigned int S45L:1;                    /**< \brief [13:13] PFLASH p Sector 45 Locked for Write Protection (rh) */
    unsigned int S46L:1;                    /**< \brief [14:14] PFLASH p Sector 46 Locked for Write Protection (rh) */
    unsigned int S47L:1;                    /**< \brief [15:15] PFLASH p Sector 47 Locked for Write Protection (rh) */
    unsigned int S48L:1;                    /**< \brief [16:16] PFLASH p Sector 48 Locked for Write Protection (rh) */
    unsigned int S49L:1;                    /**< \brief [17:17] PFLASH p Sector 49 Locked for Write Protection (rh) */
    unsigned int S50L:1;                    /**< \brief [18:18] PFLASH p Sector 50 Locked for Write Protection (rh) */
    unsigned int S51L:1;                    /**< \brief [19:19] PFLASH p Sector 51 Locked for Write Protection (rh) */
    unsigned int S52L:1;                    /**< \brief [20:20] PFLASH p Sector 52 Locked for Write Protection (rh) */
    unsigned int S53L:1;                    /**< \brief [21:21] PFLASH p Sector 53 Locked for Write Protection (rh) */
    unsigned int S54L:1;                    /**< \brief [22:22] PFLASH p Sector 54 Locked for Write Protection (rh) */
    unsigned int S55L:1;                    /**< \brief [23:23] PFLASH p Sector 55 Locked for Write Protection (rh) */
    unsigned int S56L:1;                    /**< \brief [24:24] PFLASH p Sector 56 Locked for Write Protection (rh) */
    unsigned int S57L:1;                    /**< \brief [25:25] PFLASH p Sector 57 Locked for Write Protection (rh) */
    unsigned int S58L:1;                    /**< \brief [26:26] PFLASH p Sector 58 Locked for Write Protection (rh) */
    unsigned int S59L:1;                    /**< \brief [27:27] PFLASH p Sector 59 Locked for Write Protection (rh) */
    unsigned int S60L:1;                    /**< \brief [28:28] PFLASH p Sector 60 Locked for Write Protection (rh) */
    unsigned int S61L:1;                    /**< \brief [29:29] PFLASH p Sector 61 Locked for Write Protection (rh) */
    unsigned int S62L:1;                    /**< \brief [30:30] PFLASH p Sector 62 Locked for Write Protection (rh) */
    unsigned int S63L:1;                    /**< \brief [31:31] PFLASH p Sector 63 Locked for Write Protection (rh) */
} Ifx_DMU_HP_PROCON_P1_Bits;

/** \brief  PFLASH Bank Protection Configuration 2 */
typedef struct _Ifx_DMU_HP_PROCON_P2_Bits
{
    unsigned int S64L:1;                    /**< \brief [0:0] PFLASH p Sector 64 Locked for Write Protection (rh) */
    unsigned int S65L:1;                    /**< \brief [1:1] PFLASH p Sector 65 Locked for Write Protection (rh) */
    unsigned int S66L:1;                    /**< \brief [2:2] PFLASH p Sector 66 Locked for Write Protection (rh) */
    unsigned int S67L:1;                    /**< \brief [3:3] PFLASH p Sector 67 Locked for Write Protection (rh) */
    unsigned int S68L:1;                    /**< \brief [4:4] PFLASH p Sector 68 Locked for Write Protection (rh) */
    unsigned int S69L:1;                    /**< \brief [5:5] PFLASH p Sector 69 Locked for Write Protection (rh) */
    unsigned int S70L:1;                    /**< \brief [6:6] PFLASH p Sector 70 Locked for Write Protection (rh) */
    unsigned int S71L:1;                    /**< \brief [7:7] PFLASH p Sector 71 Locked for Write Protection (rh) */
    unsigned int S72L:1;                    /**< \brief [8:8] PFLASH p Sector 72 Locked for Write Protection (rh) */
    unsigned int S73L:1;                    /**< \brief [9:9] PFLASH p Sector 73 Locked for Write Protection (rh) */
    unsigned int S74L:1;                    /**< \brief [10:10] PFLASH p Sector 74 Locked for Write Protection (rh) */
    unsigned int S75L:1;                    /**< \brief [11:11] PFLASH p Sector 75 Locked for Write Protection (rh) */
    unsigned int S76L:1;                    /**< \brief [12:12] PFLASH p Sector 76 Locked for Write Protection (rh) */
    unsigned int S77L:1;                    /**< \brief [13:13] PFLASH p Sector 77 Locked for Write Protection (rh) */
    unsigned int S78L:1;                    /**< \brief [14:14] PFLASH p Sector 78 Locked for Write Protection (rh) */
    unsigned int S79L:1;                    /**< \brief [15:15] PFLASH p Sector 79 Locked for Write Protection (rh) */
    unsigned int S80L:1;                    /**< \brief [16:16] PFLASH p Sector 80 Locked for Write Protection (rh) */
    unsigned int S81L:1;                    /**< \brief [17:17] PFLASH p Sector 81 Locked for Write Protection (rh) */
    unsigned int S82L:1;                    /**< \brief [18:18] PFLASH p Sector 82 Locked for Write Protection (rh) */
    unsigned int S83L:1;                    /**< \brief [19:19] PFLASH p Sector 83 Locked for Write Protection (rh) */
    unsigned int S84L:1;                    /**< \brief [20:20] PFLASH p Sector 84 Locked for Write Protection (rh) */
    unsigned int S85L:1;                    /**< \brief [21:21] PFLASH p Sector 85 Locked for Write Protection (rh) */
    unsigned int S86L:1;                    /**< \brief [22:22] PFLASH p Sector 86 Locked for Write Protection (rh) */
    unsigned int S87L:1;                    /**< \brief [23:23] PFLASH p Sector 87 Locked for Write Protection (rh) */
    unsigned int S88L:1;                    /**< \brief [24:24] PFLASH p Sector 88 Locked for Write Protection (rh) */
    unsigned int S89L:1;                    /**< \brief [25:25] PFLASH p Sector 89 Locked for Write Protection (rh) */
    unsigned int S90L:1;                    /**< \brief [26:26] PFLASH p Sector 90 Locked for Write Protection (rh) */
    unsigned int S91L:1;                    /**< \brief [27:27] PFLASH p Sector 91 Locked for Write Protection (rh) */
    unsigned int S92L:1;                    /**< \brief [28:28] PFLASH p Sector 92 Locked for Write Protection (rh) */
    unsigned int S93L:1;                    /**< \brief [29:29] PFLASH p Sector 93 Locked for Write Protection (rh) */
    unsigned int S94L:1;                    /**< \brief [30:30] PFLASH p Sector 94 Locked for Write Protection (rh) */
    unsigned int S95L:1;                    /**< \brief [31:31] PFLASH p Sector 95 Locked for Write Protection (rh) */
} Ifx_DMU_HP_PROCON_P2_Bits;

/** \brief  PFLASH Bank Protection Configuration 3 */
typedef struct _Ifx_DMU_HP_PROCON_P3_Bits
{
    unsigned int S96L:1;                    /**< \brief [0:0] PFLASH p Sector 96 Locked for Write Protection (rh) */
    unsigned int S97L:1;                    /**< \brief [1:1] PFLASH p Sector 97 Locked for Write Protection (rh) */
    unsigned int S98L:1;                    /**< \brief [2:2] PFLASH p Sector 98 Locked for Write Protection (rh) */
    unsigned int S99L:1;                    /**< \brief [3:3] PFLASH p Sector 99 Locked for Write Protection (rh) */
    unsigned int S100L:1;                   /**< \brief [4:4] PFLASH p Sector 100 Locked for Write Protection (rh) */
    unsigned int S101L:1;                   /**< \brief [5:5] PFLASH p Sector 101 Locked for Write Protection (rh) */
    unsigned int S102L:1;                   /**< \brief [6:6] PFLASH p Sector 102 Locked for Write Protection (rh) */
    unsigned int S103L:1;                   /**< \brief [7:7] PFLASH p Sector 103 Locked for Write Protection (rh) */
    unsigned int S104L:1;                   /**< \brief [8:8] PFLASH p Sector 104 Locked for Write Protection (rh) */
    unsigned int S105L:1;                   /**< \brief [9:9] PFLASH p Sector 105 Locked for Write Protection (rh) */
    unsigned int S106L:1;                   /**< \brief [10:10] PFLASH p Sector 106 Locked for Write Protection (rh) */
    unsigned int S107L:1;                   /**< \brief [11:11] PFLASH p Sector 107 Locked for Write Protection (rh) */
    unsigned int S108L:1;                   /**< \brief [12:12] PFLASH p Sector 108 Locked for Write Protection (rh) */
    unsigned int S109L:1;                   /**< \brief [13:13] PFLASH p Sector 109 Locked for Write Protection (rh) */
    unsigned int S110L:1;                   /**< \brief [14:14] PFLASH p Sector 110 Locked for Write Protection (rh) */
    unsigned int S111L:1;                   /**< \brief [15:15] PFLASH p Sector 111 Locked for Write Protection (rh) */
    unsigned int S112L:1;                   /**< \brief [16:16] PFLASH p Sector 112 Locked for Write Protection (rh) */
    unsigned int S113L:1;                   /**< \brief [17:17] PFLASH p Sector 113 Locked for Write Protection (rh) */
    unsigned int S114L:1;                   /**< \brief [18:18] PFLASH p Sector 114 Locked for Write Protection (rh) */
    unsigned int S115L:1;                   /**< \brief [19:19] PFLASH p Sector 115 Locked for Write Protection (rh) */
    unsigned int S116L:1;                   /**< \brief [20:20] PFLASH p Sector 116 Locked for Write Protection (rh) */
    unsigned int S117L:1;                   /**< \brief [21:21] PFLASH p Sector 117 Locked for Write Protection (rh) */
    unsigned int S118L:1;                   /**< \brief [22:22] PFLASH p Sector 118 Locked for Write Protection (rh) */
    unsigned int S119L:1;                   /**< \brief [23:23] PFLASH p Sector 119 Locked for Write Protection (rh) */
    unsigned int S120L:1;                   /**< \brief [24:24] PFLASH p Sector 120 Locked for Write Protection (rh) */
    unsigned int S121L:1;                   /**< \brief [25:25] PFLASH p Sector 121 Locked for Write Protection (rh) */
    unsigned int S122L:1;                   /**< \brief [26:26] PFLASH p Sector 122 Locked for Write Protection (rh) */
    unsigned int S123L:1;                   /**< \brief [27:27] PFLASH p Sector 123 Locked for Write Protection (rh) */
    unsigned int S124L:1;                   /**< \brief [28:28] PFLASH p Sector 124 Locked for Write Protection (rh) */
    unsigned int S125L:1;                   /**< \brief [29:29] PFLASH p Sector 125 Locked for Write Protection (rh) */
    unsigned int S126L:1;                   /**< \brief [30:30] PFLASH p Sector 126 Locked for Write Protection (rh) */
    unsigned int S127L:1;                   /**< \brief [31:31] PFLASH p Sector 127 Locked for Write Protection (rh) */
} Ifx_DMU_HP_PROCON_P3_Bits;

/** \brief  PFLASH Bank Protection Configuration 4 */
typedef struct _Ifx_DMU_HP_PROCON_P4_Bits
{
    unsigned int S128L:1;                   /**< \brief [0:0] PFLASH p Sector 128 Locked for Write Protection (rh) */
    unsigned int S129L:1;                   /**< \brief [1:1] PFLASH p Sector 129 Locked for Write Protection (rh) */
    unsigned int S130L:1;                   /**< \brief [2:2] PFLASH p Sector 130 Locked for Write Protection (rh) */
    unsigned int S131L:1;                   /**< \brief [3:3] PFLASH p Sector 131 Locked for Write Protection (rh) */
    unsigned int S132L:1;                   /**< \brief [4:4] PFLASH p Sector 132 Locked for Write Protection (rh) */
    unsigned int S133L:1;                   /**< \brief [5:5] PFLASH p Sector 133 Locked for Write Protection (rh) */
    unsigned int S134L:1;                   /**< \brief [6:6] PFLASH p Sector 134 Locked for Write Protection (rh) */
    unsigned int S135L:1;                   /**< \brief [7:7] PFLASH p Sector 135 Locked for Write Protection (rh) */
    unsigned int S136L:1;                   /**< \brief [8:8] PFLASH p Sector 136 Locked for Write Protection (rh) */
    unsigned int S137L:1;                   /**< \brief [9:9] PFLASH p Sector 137 Locked for Write Protection (rh) */
    unsigned int S138L:1;                   /**< \brief [10:10] PFLASH p Sector 138 Locked for Write Protection (rh) */
    unsigned int S139L:1;                   /**< \brief [11:11] PFLASH p Sector 139 Locked for Write Protection (rh) */
    unsigned int S140L:1;                   /**< \brief [12:12] PFLASH p Sector 140 Locked for Write Protection (rh) */
    unsigned int S141L:1;                   /**< \brief [13:13] PFLASH p Sector 141 Locked for Write Protection (rh) */
    unsigned int S142L:1;                   /**< \brief [14:14] PFLASH p Sector 142 Locked for Write Protection (rh) */
    unsigned int S143L:1;                   /**< \brief [15:15] PFLASH p Sector 143 Locked for Write Protection (rh) */
    unsigned int S144L:1;                   /**< \brief [16:16] PFLASH p Sector 144 Locked for Write Protection (rh) */
    unsigned int S145L:1;                   /**< \brief [17:17] PFLASH p Sector 145 Locked for Write Protection (rh) */
    unsigned int S146L:1;                   /**< \brief [18:18] PFLASH p Sector 146 Locked for Write Protection (rh) */
    unsigned int S147L:1;                   /**< \brief [19:19] PFLASH p Sector 147 Locked for Write Protection (rh) */
    unsigned int S148L:1;                   /**< \brief [20:20] PFLASH p Sector 148 Locked for Write Protection (rh) */
    unsigned int S149L:1;                   /**< \brief [21:21] PFLASH p Sector 149 Locked for Write Protection (rh) */
    unsigned int S150L:1;                   /**< \brief [22:22] PFLASH p Sector 150 Locked for Write Protection (rh) */
    unsigned int S151L:1;                   /**< \brief [23:23] PFLASH p Sector 151 Locked for Write Protection (rh) */
    unsigned int S152L:1;                   /**< \brief [24:24] PFLASH p Sector 152 Locked for Write Protection (rh) */
    unsigned int S153L:1;                   /**< \brief [25:25] PFLASH p Sector 153 Locked for Write Protection (rh) */
    unsigned int S154L:1;                   /**< \brief [26:26] PFLASH p Sector 154 Locked for Write Protection (rh) */
    unsigned int S155L:1;                   /**< \brief [27:27] PFLASH p Sector 155 Locked for Write Protection (rh) */
    unsigned int S156L:1;                   /**< \brief [28:28] PFLASH p Sector 156 Locked for Write Protection (rh) */
    unsigned int S157L:1;                   /**< \brief [29:29] PFLASH p Sector 157 Locked for Write Protection (rh) */
    unsigned int S158L:1;                   /**< \brief [30:30] PFLASH p Sector 158 Locked for Write Protection (rh) */
    unsigned int S159L:1;                   /**< \brief [31:31] PFLASH p Sector 159 Locked for Write Protection (rh) */
} Ifx_DMU_HP_PROCON_P4_Bits;

/** \brief  PFLASH Bank Protection Configuration 5 */
typedef struct _Ifx_DMU_HP_PROCON_P5_Bits
{
    unsigned int S160L:1;                   /**< \brief [0:0] PFLASH p Sector 160 Locked for Write Protection (rh) */
    unsigned int S161L:1;                   /**< \brief [1:1] PFLASH p Sector 161 Locked for Write Protection (rh) */
    unsigned int S162L:1;                   /**< \brief [2:2] PFLASH p Sector 162 Locked for Write Protection (rh) */
    unsigned int S163L:1;                   /**< \brief [3:3] PFLASH p Sector 163 Locked for Write Protection (rh) */
    unsigned int S164L:1;                   /**< \brief [4:4] PFLASH p Sector 164 Locked for Write Protection (rh) */
    unsigned int S165L:1;                   /**< \brief [5:5] PFLASH p Sector 165 Locked for Write Protection (rh) */
    unsigned int S166L:1;                   /**< \brief [6:6] PFLASH p Sector 166 Locked for Write Protection (rh) */
    unsigned int S167L:1;                   /**< \brief [7:7] PFLASH p Sector 167 Locked for Write Protection (rh) */
    unsigned int S168L:1;                   /**< \brief [8:8] PFLASH p Sector 168 Locked for Write Protection (rh) */
    unsigned int S169L:1;                   /**< \brief [9:9] PFLASH p Sector 169 Locked for Write Protection (rh) */
    unsigned int S170L:1;                   /**< \brief [10:10] PFLASH p Sector 170 Locked for Write Protection (rh) */
    unsigned int S171L:1;                   /**< \brief [11:11] PFLASH p Sector 171 Locked for Write Protection (rh) */
    unsigned int S172L:1;                   /**< \brief [12:12] PFLASH p Sector 172 Locked for Write Protection (rh) */
    unsigned int S173L:1;                   /**< \brief [13:13] PFLASH p Sector 173 Locked for Write Protection (rh) */
    unsigned int S174L:1;                   /**< \brief [14:14] PFLASH p Sector 174 Locked for Write Protection (rh) */
    unsigned int S175L:1;                   /**< \brief [15:15] PFLASH p Sector 175 Locked for Write Protection (rh) */
    unsigned int S176L:1;                   /**< \brief [16:16] PFLASH p Sector 176 Locked for Write Protection (rh) */
    unsigned int S177L:1;                   /**< \brief [17:17] PFLASH p Sector 177 Locked for Write Protection (rh) */
    unsigned int S178L:1;                   /**< \brief [18:18] PFLASH p Sector 178 Locked for Write Protection (rh) */
    unsigned int S179L:1;                   /**< \brief [19:19] PFLASH p Sector 179 Locked for Write Protection (rh) */
    unsigned int S180L:1;                   /**< \brief [20:20] PFLASH p Sector 180 Locked for Write Protection (rh) */
    unsigned int S181L:1;                   /**< \brief [21:21] PFLASH p Sector 181 Locked for Write Protection (rh) */
    unsigned int S182L:1;                   /**< \brief [22:22] PFLASH p Sector 182 Locked for Write Protection (rh) */
    unsigned int S183L:1;                   /**< \brief [23:23] PFLASH p Sector 183 Locked for Write Protection (rh) */
    unsigned int S184L:1;                   /**< \brief [24:24] PFLASH p Sector 184 Locked for Write Protection (rh) */
    unsigned int S185L:1;                   /**< \brief [25:25] PFLASH p Sector 185 Locked for Write Protection (rh) */
    unsigned int S186L:1;                   /**< \brief [26:26] PFLASH p Sector 186 Locked for Write Protection (rh) */
    unsigned int S187L:1;                   /**< \brief [27:27] PFLASH p Sector 187 Locked for Write Protection (rh) */
    unsigned int S188L:1;                   /**< \brief [28:28] PFLASH p Sector 188 Locked for Write Protection (rh) */
    unsigned int S189L:1;                   /**< \brief [29:29] PFLASH p Sector 189 Locked for Write Protection (rh) */
    unsigned int S190L:1;                   /**< \brief [30:30] PFLASH p Sector 190 Locked for Write Protection (rh) */
    unsigned int S191L:1;                   /**< \brief [31:31] PFLASH p Sector 191 Locked for Write Protection (rh) */
} Ifx_DMU_HP_PROCON_P5_Bits;

/** \brief  PFLASH Bank WOP Configuration 0 */
typedef struct _Ifx_DMU_HP_PROCON_WOP0_Bits
{
    unsigned int S0WOP:1;                   /**< \brief [0:0] PFLASH p Sector 0 Configured for Write-Once Protection (rh) */
    unsigned int S1WOP:1;                   /**< \brief [1:1] PFLASH p Sector 1 Configured for Write-Once Protection (rh) */
    unsigned int S2WOP:1;                   /**< \brief [2:2] PFLASH p Sector 2 Configured for Write-Once Protection (rh) */
    unsigned int S3WOP:1;                   /**< \brief [3:3] PFLASH p Sector 3 Configured for Write-Once Protection (rh) */
    unsigned int S4WOP:1;                   /**< \brief [4:4] PFLASH p Sector 4 Configured for Write-Once Protection (rh) */
    unsigned int S5WOP:1;                   /**< \brief [5:5] PFLASH p Sector 5 Configured for Write-Once Protection (rh) */
    unsigned int S6WOP:1;                   /**< \brief [6:6] PFLASH p Sector 6 Configured for Write-Once Protection (rh) */
    unsigned int S7WOP:1;                   /**< \brief [7:7] PFLASH p Sector 7 Configured for Write-Once Protection (rh) */
    unsigned int S8WOP:1;                   /**< \brief [8:8] PFLASH p Sector 8 Configured for Write-Once Protection (rh) */
    unsigned int S9WOP:1;                   /**< \brief [9:9] PFLASH p Sector 9 Configured for Write-Once Protection (rh) */
    unsigned int S10WOP:1;                  /**< \brief [10:10] PFLASH p Sector 10 Configured for Write-Once Protection (rh) */
    unsigned int S11WOP:1;                  /**< \brief [11:11] PFLASH p Sector 11 Configured for Write-Once Protection (rh) */
    unsigned int S12WOP:1;                  /**< \brief [12:12] PFLASH p Sector 12 Configured for Write-Once Protection (rh) */
    unsigned int S13WOP:1;                  /**< \brief [13:13] PFLASH p Sector 13 Configured for Write-Once Protection (rh) */
    unsigned int S14WOP:1;                  /**< \brief [14:14] PFLASH p Sector 14 Configured for Write-Once Protection (rh) */
    unsigned int S15WOP:1;                  /**< \brief [15:15] PFLASH p Sector 15 Configured for Write-Once Protection (rh) */
    unsigned int S16WOP:1;                  /**< \brief [16:16] PFLASH p Sector 16 Configured for Write-Once Protection (rh) */
    unsigned int S17WOP:1;                  /**< \brief [17:17] PFLASH p Sector 17 Configured for Write-Once Protection (rh) */
    unsigned int S18WOP:1;                  /**< \brief [18:18] PFLASH p Sector 18 Configured for Write-Once Protection (rh) */
    unsigned int S19WOP:1;                  /**< \brief [19:19] PFLASH p Sector 19 Configured for Write-Once Protection (rh) */
    unsigned int S20WOP:1;                  /**< \brief [20:20] PFLASH p Sector 20 Configured for Write-Once Protection (rh) */
    unsigned int S21WOP:1;                  /**< \brief [21:21] PFLASH p Sector 21 Configured for Write-Once Protection (rh) */
    unsigned int S22WOP:1;                  /**< \brief [22:22] PFLASH p Sector 22 Configured for Write-Once Protection (rh) */
    unsigned int S23WOP:1;                  /**< \brief [23:23] PFLASH p Sector 23 Configured for Write-Once Protection (rh) */
    unsigned int S24WOP:1;                  /**< \brief [24:24] PFLASH p Sector 24 Configured for Write-Once Protection (rh) */
    unsigned int S25WOP:1;                  /**< \brief [25:25] PFLASH p Sector 25 Configured for Write-Once Protection (rh) */
    unsigned int S26WOP:1;                  /**< \brief [26:26] PFLASH p Sector 26 Configured for Write-Once Protection (rh) */
    unsigned int S27WOP:1;                  /**< \brief [27:27] PFLASH p Sector 27 Configured for Write-Once Protection (rh) */
    unsigned int S28WOP:1;                  /**< \brief [28:28] PFLASH p Sector 28 Configured for Write-Once Protection (rh) */
    unsigned int S29WOP:1;                  /**< \brief [29:29] PFLASH p Sector 29 Configured for Write-Once Protection (rh) */
    unsigned int S30WOP:1;                  /**< \brief [30:30] PFLASH p Sector 30 Configured for Write-Once Protection (rh) */
    unsigned int S31WOP:1;                  /**< \brief [31:31] PFLASH p Sector 31 Configured for Write-Once Protection (rh) */
} Ifx_DMU_HP_PROCON_WOP0_Bits;

