Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  PFLASH Bank WOP Configuration 1 */
typedef struct _Ifx_DMU_HP_PROCON_WOP1_Bits
{
    unsigned int S32WOP:1;                  /**< \brief [0:0] PFLASH p Sector 32 Configured for Write-Once Protection (rh) */
    unsigned int S33WOP:1;                  /**< \brief [1:1] PFLASH p Sector 33 Configured for Write-Once Protection (rh) */
    unsigned int S34WOP:1;                  /**< \brief [2:2] PFLASH p Sector 34 Configured for Write-Once Protection (rh) */
    unsigned int S35WOP:1;                  /**< \brief [3:3] PFLASH p Sector 35 Configured for Write-Once Protection (rh) */
    unsigned int S36WOP:1;                  /**< \brief [4:4] PFLASH p Sector 36 Configured for Write-Once Protection (rh) */
    unsigned int S37WOP:1;                  /**< \brief [5:5] PFLASH p Sector 37 Configured for Write-Once Protection (rh) */
    unsigned int S38WOP:1;                  /**< \brief [6:6] PFLASH p Sector 38 Configured for Write-Once Protection (rh) */
    unsigned int S39WOP:1;                  /**< \brief [7:7] PFLASH p Sector 39 Configured for Write-Once Protection (rh) */
    unsigned int S40WOP:1;                  /**< \brief [8:8] PFLASH p Sector 40 Configured for Write-Once Protection (rh) */
    unsigned int S41WOP:1;                  /**< \brief [9:9] PFLASH p Sector 41 Configured for Write-Once Protection (rh) */
    unsigned int S42WOP:1;                  /**< \brief [10:10] PFLASH p Sector 42 Configured for Write-Once Protection (rh) */
    unsigned int S43WOP:1;                  /**< \brief [11:11] PFLASH p Sector 43 Configured for Write-Once Protection (rh) */
    unsigned int S44WOP:1;                  /**< \brief [12:12] PFLASH p Sector 44 Configured for Write-Once Protection (rh) */
    unsigned int S45WOP:1;                  /**< \brief [13:13] PFLASH p Sector 45 Configured for Write-Once Protection (rh) */
    unsigned int S46WOP:1;                  /**< \brief [14:14] PFLASH p Sector 46 Configured for Write-Once Protection (rh) */
    unsigned int S47WOP:1;                  /**< \brief [15:15] PFLASH p Sector 47 Configured for Write-Once Protection (rh) */
    unsigned int S48WOP:1;                  /**< \brief [16:16] PFLASH p Sector 48 Configured for Write-Once Protection (rh) */
    unsigned int S49WOP:1;                  /**< \brief [17:17] PFLASH p Sector 49 Configured for Write-Once Protection (rh) */
    unsigned int S50WOP:1;                  /**< \brief [18:18] PFLASH p Sector 50 Configured for Write-Once Protection (rh) */
    unsigned int S51WOP:1;                  /**< \brief [19:19] PFLASH p Sector 51 Configured for Write-Once Protection (rh) */
    unsigned int S52WOP:1;                  /**< \brief [20:20] PFLASH p Sector 52 Configured for Write-Once Protection (rh) */
    unsigned int S53WOP:1;                  /**< \brief [21:21] PFLASH p Sector 53 Configured for Write-Once Protection (rh) */
    unsigned int S54WOP:1;                  /**< \brief [22:22] PFLASH p Sector 54 Configured for Write-Once Protection (rh) */
    unsigned int S55WOP:1;                  /**< \brief [23:23] PFLASH p Sector 55 Configured for Write-Once Protection (rh) */
    unsigned int S56WOP:1;                  /**< \brief [24:24] PFLASH p Sector 56 Configured for Write-Once Protection (rh) */
    unsigned int S57WOP:1;                  /**< \brief [25:25] PFLASH p Sector 57 Configured for Write-Once Protection (rh) */
    unsigned int S58WOP:1;                  /**< \brief [26:26] PFLASH p Sector 58 Configured for Write-Once Protection (rh) */
    unsigned int S59WOP:1;                  /**< \brief [27:27] PFLASH p Sector 59 Configured for Write-Once Protection (rh) */
    unsigned int S60WOP:1;                  /**< \brief [28:28] PFLASH p Sector 60 Configured for Write-Once Protection (rh) */
    unsigned int S61WOP:1;                  /**< \brief [29:29] PFLASH p Sector 61 Configured for Write-Once Protection (rh) */
    unsigned int S62WOP:1;                  /**< \brief [30:30] PFLASH p Sector 62 Configured for Write-Once Protection (rh) */
    unsigned int S63WOP:1;                  /**< \brief [31:31] PFLASH p Sector 63 Configured for Write-Once Protection (rh) */
} Ifx_DMU_HP_PROCON_WOP1_Bits;

/** \brief  PFLASH Bank WOP Configuration 2 */
typedef struct _Ifx_DMU_HP_PROCON_WOP2_Bits
{
    unsigned int S64WOP:1;                  /**< \brief [0:0] PFLASH p Sector 64 Configured for Write-Once Protection (rh) */
    unsigned int S65WOP:1;                  /**< \brief [1:1] PFLASH p Sector 65 Configured for Write-Once Protection (rh) */
    unsigned int S66WOP:1;                  /**< \brief [2:2] PFLASH p Sector 66 Configured for Write-Once Protection (rh) */
    unsigned int S67WOP:1;                  /**< \brief [3:3] PFLASH p Sector 67 Configured for Write-Once Protection (rh) */
    unsigned int S68WOP:1;                  /**< \brief [4:4] PFLASH p Sector 68 Configured for Write-Once Protection (rh) */
    unsigned int S69WOP:1;                  /**< \brief [5:5] PFLASH p Sector 69 Configured for Write-Once Protection (rh) */
    unsigned int S70WOP:1;                  /**< \brief [6:6] PFLASH p Sector 70 Configured for Write-Once Protection (rh) */
    unsigned int S71WOP:1;                  /**< \brief [7:7] PFLASH p Sector 71 Configured for Write-Once Protection (rh) */
    unsigned int S72WOP:1;                  /**< \brief [8:8] PFLASH p Sector 72 Configured for Write-Once Protection (rh) */
    unsigned int S73WOP:1;                  /**< \brief [9:9] PFLASH p Sector 73 Configured for Write-Once Protection (rh) */
    unsigned int S74WOP:1;                  /**< \brief [10:10] PFLASH p Sector 74 Configured for Write-Once Protection (rh) */
    unsigned int S75WOP:1;                  /**< \brief [11:11] PFLASH p Sector 75 Configured for Write-Once Protection (rh) */
    unsigned int S76WOP:1;                  /**< \brief [12:12] PFLASH p Sector 76 Configured for Write-Once Protection (rh) */
    unsigned int S77WOP:1;                  /**< \brief [13:13] PFLASH p Sector 77 Configured for Write-Once Protection (rh) */
    unsigned int S78WOP:1;                  /**< \brief [14:14] PFLASH p Sector 78 Configured for Write-Once Protection (rh) */
    unsigned int S79WOP:1;                  /**< \brief [15:15] PFLASH p Sector 79 Configured for Write-Once Protection (rh) */
    unsigned int S80WOP:1;                  /**< \brief [16:16] PFLASH p Sector 80 Configured for Write-Once Protection (rh) */
    unsigned int S81WOP:1;                  /**< \brief [17:17] PFLASH p Sector 81 Configured for Write-Once Protection (rh) */
    unsigned int S82WOP:1;                  /**< \brief [18:18] PFLASH p Sector 82 Configured for Write-Once Protection (rh) */
    unsigned int S83WOP:1;                  /**< \brief [19:19] PFLASH p Sector 83 Configured for Write-Once Protection (rh) */
    unsigned int S84WOP:1;                  /**< \brief [20:20] PFLASH p Sector 84 Configured for Write-Once Protection (rh) */
    unsigned int S85WOP:1;                  /**< \brief [21:21] PFLASH p Sector 85 Configured for Write-Once Protection (rh) */
    unsigned int S86WOP:1;                  /**< \brief [22:22] PFLASH p Sector 86 Configured for Write-Once Protection (rh) */
    unsigned int S87WOP:1;                  /**< \brief [23:23] PFLASH p Sector 87 Configured for Write-Once Protection (rh) */
    unsigned int S88WOP:1;                  /**< \brief [24:24] PFLASH p Sector 88 Configured for Write-Once Protection (rh) */
    unsigned int S89WOP:1;                  /**< \brief [25:25] PFLASH p Sector 89 Configured for Write-Once Protection (rh) */
    unsigned int S90WOP:1;                  /**< \brief [26:26] PFLASH p Sector 90 Configured for Write-Once Protection (rh) */
    unsigned int S91WOP:1;                  /**< \brief [27:27] PFLASH p Sector 91 Configured for Write-Once Protection (rh) */
    unsigned int S92WOP:1;                  /**< \brief [28:28] PFLASH p Sector 92 Configured for Write-Once Protection (rh) */
    unsigned int S93WOP:1;                  /**< \brief [29:29] PFLASH p Sector 93 Configured for Write-Once Protection (rh) */
    unsigned int S94WOP:1;                  /**< \brief [30:30] PFLASH p Sector 94 Configured for Write-Once Protection (rh) */
    unsigned int S95WOP:1;                  /**< \brief [31:31] PFLASH p Sector 95 Configured for Write-Once Protection (rh) */
} Ifx_DMU_HP_PROCON_WOP2_Bits;

/** \brief  PFLASH Bank WOP Configuration 3 */
typedef struct _Ifx_DMU_HP_PROCON_WOP3_Bits
{
    unsigned int S96WOP:1;                  /**< \brief [0:0] PFLASH p Sector 96 Configured for Write-Once Protection (rh) */
    unsigned int S97WOP:1;                  /**< \brief [1:1] PFLASH p Sector 97 Configured for Write-Once Protection (rh) */
    unsigned int S98WOP:1;                  /**< \brief [2:2] PFLASH p Sector 98 Configured for Write-Once Protection (rh) */
    unsigned int S99WOP:1;                  /**< \brief [3:3] PFLASH p Sector 99 Configured for Write-Once Protection (rh) */
    unsigned int S100WOP:1;                 /**< \brief [4:4] PFLASH p Sector 100 Configured for Write-Once Protection (rh) */
    unsigned int S101WOP:1;                 /**< \brief [5:5] PFLASH p Sector 101 Configured for Write-Once Protection (rh) */
    unsigned int S102WOP:1;                 /**< \brief [6:6] PFLASH p Sector 102 Configured for Write-Once Protection (rh) */
    unsigned int S103WOP:1;                 /**< \brief [7:7] PFLASH p Sector 103 Configured for Write-Once Protection (rh) */
    unsigned int S104WOP:1;                 /**< \brief [8:8] PFLASH p Sector 104 Configured for Write-Once Protection (rh) */
    unsigned int S105WOP:1;                 /**< \brief [9:9] PFLASH p Sector 105 Configured for Write-Once Protection (rh) */
    unsigned int S106WOP:1;                 /**< \brief [10:10] PFLASH p Sector 106 Configured for Write-Once Protection (rh) */
    unsigned int S107WOP:1;                 /**< \brief [11:11] PFLASH p Sector 107 Configured for Write-Once Protection (rh) */
    unsigned int S108WOP:1;                 /**< \brief [12:12] PFLASH p Sector 108 Configured for Write-Once Protection (rh) */
    unsigned int S109WOP:1;                 /**< \brief [13:13] PFLASH p Sector 109 Configured for Write-Once Protection (rh) */
    unsigned int S110WOP:1;                 /**< \brief [14:14] PFLASH p Sector 110 Configured for Write-Once Protection (rh) */
    unsigned int S111WOP:1;                 /**< \brief [15:15] PFLASH p Sector 111 Configured for Write-Once Protection (rh) */
    unsigned int S112WOP:1;                 /**< \brief [16:16] PFLASH p Sector 112 Configured for Write-Once Protection (rh) */
    unsigned int S113WOP:1;                 /**< \brief [17:17] PFLASH p Sector 113 Configured for Write-Once Protection (rh) */
    unsigned int S114WOP:1;                 /**< \brief [18:18] PFLASH p Sector 114 Configured for Write-Once Protection (rh) */
    unsigned int S115WOP:1;                 /**< \brief [19:19] PFLASH p Sector 115 Configured for Write-Once Protection (rh) */
    unsigned int S116WOP:1;                 /**< \brief [20:20] PFLASH p Sector 116 Configured for Write-Once Protection (rh) */
    unsigned int S117WOP:1;                 /**< \brief [21:21] PFLASH p Sector 117 Configured for Write-Once Protection (rh) */
    unsigned int S118WOP:1;                 /**< \brief [22:22] PFLASH p Sector 118 Configured for Write-Once Protection (rh) */
    unsigned int S119WOP:1;                 /**< \brief [23:23] PFLASH p Sector 119 Configured for Write-Once Protection (rh) */
    unsigned int S120WOP:1;                 /**< \brief [24:24] PFLASH p Sector 120 Configured for Write-Once Protection (rh) */
    unsigned int S121WOP:1;                 /**< \brief [25:25] PFLASH p Sector 121 Configured for Write-Once Protection (rh) */
    unsigned int S122WOP:1;                 /**< \brief [26:26] PFLASH p Sector 122 Configured for Write-Once Protection (rh) */
    unsigned int S123WOP:1;                 /**< \brief [27:27] PFLASH p Sector 123 Configured for Write-Once Protection (rh) */
    unsigned int S124WOP:1;                 /**< \brief [28:28] PFLASH p Sector 124 Configured for Write-Once Protection (rh) */
    unsigned int S125WOP:1;                 /**< \brief [29:29] PFLASH p Sector 125 Configured for Write-Once Protection (rh) */
    unsigned int S126WOP:1;                 /**< \brief [30:30] PFLASH p Sector 126 Configured for Write-Once Protection (rh) */
    unsigned int S127WOP:1;                 /**< \brief [31:31] PFLASH p Sector 127 Configured for Write-Once Protection (rh) */
} Ifx_DMU_HP_PROCON_WOP3_Bits;

/** \brief  PFLASH Bank WOP Configuration 4 */
typedef struct _Ifx_DMU_HP_PROCON_WOP4_Bits
{
    unsigned int S128WOP:1;                 /**< \brief [0:0] PFLASH p Sector 128 Configured for Write-Once Protection (rh) */
    unsigned int S129WOP:1;                 /**< \brief [1:1] PFLASH p Sector 129 Configured for Write-Once Protection (rh) */
    unsigned int S130WOP:1;                 /**< \brief [2:2] PFLASH p Sector 130 Configured for Write-Once Protection (rh) */
    unsigned int S131WOP:1;                 /**< \brief [3:3] PFLASH p Sector 131 Configured for Write-Once Protection (rh) */
    unsigned int S132WOP:1;                 /**< \brief [4:4] PFLASH p Sector 132 Configured for Write-Once Protection (rh) */
    unsigned int S133WOP:1;                 /**< \brief [5:5] PFLASH p Sector 133 Configured for Write-Once Protection (rh) */
    unsigned int S134WOP:1;                 /**< \brief [6:6] PFLASH p Sector 134 Configured for Write-Once Protection (rh) */
    unsigned int S135WOP:1;                 /**< \brief [7:7] PFLASH p Sector 135 Configured for Write-Once Protection (rh) */
    unsigned int S136WOP:1;                 /**< \brief [8:8] PFLASH p Sector 136 Configured for Write-Once Protection (rh) */
    unsigned int S137WOP:1;                 /**< \brief [9:9] PFLASH p Sector 137 Configured for Write-Once Protection (rh) */
    unsigned int S138WOP:1;                 /**< \brief [10:10] PFLASH p Sector 138 Configured for Write-Once Protection (rh) */
    unsigned int S139WOP:1;                 /**< \brief [11:11] PFLASH p Sector 139 Configured for Write-Once Protection (rh) */
    unsigned int S140WOP:1;                 /**< \brief [12:12] PFLASH p Sector 140 Configured for Write-Once Protection (rh) */
    unsigned int S141WOP:1;                 /**< \brief [13:13] PFLASH p Sector 141 Configured for Write-Once Protection (rh) */
    unsigned int S142WOP:1;                 /**< \brief [14:14] PFLASH p Sector 142 Configured for Write-Once Protection (rh) */
    unsigned int S143WOP:1;                 /**< \brief [15:15] PFLASH p Sector 143 Configured for Write-Once Protection (rh) */
    unsigned int S144WOP:1;                 /**< \brief [16:16] PFLASH p Sector 144 Configured for Write-Once Protection (rh) */
    unsigned int S145WOP:1;                 /**< \brief [17:17] PFLASH p Sector 145 Configured for Write-Once Protection (rh) */
    unsigned int S146WOP:1;                 /**< \brief [18:18] PFLASH p Sector 146 Configured for Write-Once Protection (rh) */
    unsigned int S147WOP:1;                 /**< \brief [19:19] PFLASH p Sector 147 Configured for Write-Once Protection (rh) */
    unsigned int S148WOP:1;                 /**< \brief [20:20] PFLASH p Sector 148 Configured for Write-Once Protection (rh) */
    unsigned int S149WOP:1;                 /**< \brief [21:21] PFLASH p Sector 149 Configured for Write-Once Protection (rh) */
    unsigned int S150WOP:1;                 /**< \brief [22:22] PFLASH p Sector 150 Configured for Write-Once Protection (rh) */
    unsigned int S151WOP:1;                 /**< \brief [23:23] PFLASH p Sector 151 Configured for Write-Once Protection (rh) */
    unsigned int S152WOP:1;                 /**< \brief [24:24] PFLASH p Sector 152 Configured for Write-Once Protection (rh) */
    unsigned int S153WOP:1;                 /**< \brief [25:25] PFLASH p Sector 153 Configured for Write-Once Protection (rh) */
    unsigned int S154WOP:1;                 /**< \brief [26:26] PFLASH p Sector 154 Configured for Write-Once Protection (rh) */
    unsigned int S155WOP:1;                 /**< \brief [27:27] PFLASH p Sector 155 Configured for Write-Once Protection (rh) */
    unsigned int S156WOP:1;                 /**< \brief [28:28] PFLASH p Sector 156 Configured for Write-Once Protection (rh) */
    unsigned int S157WOP:1;                 /**< \brief [29:29] PFLASH p Sector 157 Configured for Write-Once Protection (rh) */
    unsigned int S158WOP:1;                 /**< \brief [30:30] PFLASH p Sector 158 Configured for Write-Once Protection (rh) */
    unsigned int S159WOP:1;                 /**< \brief [31:31] PFLASH p Sector 159 Configured for Write-Once Protection (rh) */
} Ifx_DMU_HP_PROCON_WOP4_Bits;

/** \brief  PFLASH Bank WOP Configuration 5 */
typedef struct _Ifx_DMU_HP_PROCON_WOP5_Bits
{
    unsigned int S160WOP:1;                 /**< \brief [0:0] PFLASH p Sector 160 Configured for Write-Once Protection (rh) */
    unsigned int S161WOP:1;                 /**< \brief [1:1] PFLASH p Sector 161 Configured for Write-Once Protection (rh) */
    unsigned int S162WOP:1;                 /**< \brief [2:2] PFLASH p Sector 162 Configured for Write-Once Protection (rh) */
    unsigned int S163WOP:1;                 /**< \brief [3:3] PFLASH p Sector 163 Configured for Write-Once Protection (rh) */
    unsigned int S164WOP:1;                 /**< \brief [4:4] PFLASH p Sector 164 Configured for Write-Once Protection (rh) */
    unsigned int S165WOP:1;                 /**< \brief [5:5] PFLASH p Sector 165 Configured for Write-Once Protection (rh) */
    unsigned int S166WOP:1;                 /**< \brief [6:6] PFLASH p Sector 166 Configured for Write-Once Protection (rh) */
    unsigned int S167WOP:1;                 /**< \brief [7:7] PFLASH p Sector 167 Configured for Write-Once Protection (rh) */
    unsigned int S168WOP:1;                 /**< \brief [8:8] PFLASH p Sector 168 Configured for Write-Once Protection (rh) */
    unsigned int S169WOP:1;                 /**< \brief [9:9] PFLASH p Sector 169 Configured for Write-Once Protection (rh) */
    unsigned int S170WOP:1;                 /**< \brief [10:10] PFLASH p Sector 170 Configured for Write-Once Protection (rh) */
    unsigned int S171WOP:1;                 /**< \brief [11:11] PFLASH p Sector 171 Configured for Write-Once Protection (rh) */
    unsigned int S172WOP:1;                 /**< \brief [12:12] PFLASH p Sector 172 Configured for Write-Once Protection (rh) */
    unsigned int S173WOP:1;                 /**< \brief [13:13] PFLASH p Sector 173 Configured for Write-Once Protection (rh) */
    unsigned int S174WOP:1;                 /**< \brief [14:14] PFLASH p Sector 174 Configured for Write-Once Protection (rh) */
    unsigned int S175WOP:1;                 /**< \brief [15:15] PFLASH p Sector 175 Configured for Write-Once Protection (rh) */
    unsigned int S176WOP:1;                 /**< \brief [16:16] PFLASH p Sector 176 Configured for Write-Once Protection (rh) */
    unsigned int S177WOP:1;                 /**< \brief [17:17] PFLASH p Sector 177 Configured for Write-Once Protection (rh) */
    unsigned int S178WOP:1;                 /**< \brief [18:18] PFLASH p Sector 178 Configured for Write-Once Protection (rh) */
    unsigned int S179WOP:1;                 /**< \brief [19:19] PFLASH p Sector 179 Configured for Write-Once Protection (rh) */
    unsigned int S180WOP:1;                 /**< \brief [20:20] PFLASH p Sector 180 Configured for Write-Once Protection (rh) */
    unsigned int S181WOP:1;                 /**< \brief [21:21] PFLASH p Sector 181 Configured for Write-Once Protection (rh) */
    unsigned int S182WOP:1;                 /**< \brief [22:22] PFLASH p Sector 182 Configured for Write-Once Protection (rh) */
    unsigned int S183WOP:1;                 /**< \brief [23:23] PFLASH p Sector 183 Configured for Write-Once Protection (rh) */
    unsigned int S184WOP:1;                 /**< \brief [24:24] PFLASH p Sector 184 Configured for Write-Once Protection (rh) */
    unsigned int S185WOP:1;                 /**< \brief [25:25] PFLASH p Sector 185 Configured for Write-Once Protection (rh) */
    unsigned int S186WOP:1;                 /**< \brief [26:26] PFLASH p Sector 186 Configured for Write-Once Protection (rh) */
    unsigned int S187WOP:1;                 /**< \brief [27:27] PFLASH p Sector 187 Configured for Write-Once Protection (rh) */
    unsigned int S188WOP:1;                 /**< \brief [28:28] PFLASH p Sector 188 Configured for Write-Once Protection (rh) */
    unsigned int S189WOP:1;                 /**< \brief [29:29] PFLASH p Sector 189 Configured for Write-Once Protection (rh) */
    unsigned int S190WOP:1;                 /**< \brief [30:30] PFLASH p Sector 190 Configured for Write-Once Protection (rh) */
    unsigned int S191WOP:1;                 /**< \brief [31:31] PFLASH p Sector 191 Configured for Write-Once Protection (rh) */
} Ifx_DMU_HP_PROCON_WOP5_Bits;

/** \brief  Clear Error Register */
typedef struct _Ifx_DMU_SF_CLRE_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int CSQER:1;                   /**< \brief [1:1] Clear Command Sequence Error (w) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int CPVER:1;                   /**< \brief [3:3] Clear Program Verify Error (w) */
    unsigned int CEVER:1;                   /**< \brief [4:4] Clear Erase Verify Error (w) */
    unsigned int reserved_5:27;             /**< \brief \internal Reserved */
} Ifx_DMU_SF_CLRE_Bits;

/** \brief  HSM Flash Configuration Register */
typedef struct _Ifx_DMU_SF_CONTROL_Bits
{
    unsigned int LCKHSMUCB:2;               /**< \brief [1:0] Lock Access to UCB_HSMCFG (rwh) */
    unsigned int reserved_2:14;             /**< \brief \internal Reserved */
    unsigned int CPROG:1;                   /**< \brief [16:16] Clear Programming State (w) */
    unsigned int CERASE:1;                  /**< \brief [17:17] Clear Erase State (w) */
    unsigned int CUSER:1;                   /**< \brief [18:18] Clear User State (w) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_DMU_SF_CONTROL_Bits;

