Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  DF1 ECC Control Register */
typedef struct _Ifx_DMU_SF_ECCC_Bits
{
    unsigned int CLR:2;                     /**< \brief [1:0] Clear ECC status bits (w) */
    unsigned int reserved_2:26;             /**< \brief \internal Reserved */
    unsigned int ECCCORDIS:2;               /**< \brief [29:28] HSM Command Interface ECC Correction Disable (rw) */
    unsigned int TRAPDIS:2;                 /**< \brief [31:30] HSM Command Interface Uncorrectable ECC Bit Error Trap Disable (rw) */
} Ifx_DMU_SF_ECCC_Bits;

/** \brief  DF1 ECC Read Register */
typedef struct _Ifx_DMU_SF_ECCR_Bits
{
    unsigned int RCODE:22;                  /**< \brief [21:0] Error Correction Read Code (rh) */
    unsigned int RED:2;                     /**< \brief [23:22] Redundant Bits (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DMU_SF_ECCR_Bits;

/** \brief  DF1 ECC Status Register */
typedef struct _Ifx_DMU_SF_ECCS_Bits
{
    unsigned int ERR1:1;                    /**< \brief [0:0] Read Access Single Bit ECC Error (rh) */
    unsigned int ERR2:1;                    /**< \brief [1:1] Read Access Double Bit ECC Error (rh) */
    unsigned int ERR3:1;                    /**< \brief [2:2] Read Access Triple Bit ECC Error (rh) */
    unsigned int ERRM:1;                    /**< \brief [3:3] Read Access Multi-bit ECC Error (rh) */
    unsigned int reserved_4:3;              /**< \brief \internal Reserved */
    unsigned int ERRANY:1;                  /**< \brief [7:7] Any Read Access ECC Error (rh) */
    unsigned int BLANKD:1;                  /**< \brief [8:8] Read Access Blank Digital (rh) */
    unsigned int BLANKA:1;                  /**< \brief [9:9] Read Access Blank Analog (rh) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int AER1:1;                    /**< \brief [16:16] Accumulated Single Bit ECC Errors (rh) */
    unsigned int AER2:1;                    /**< \brief [17:17] Accumulated Double Bit ECC Errors (rh) */
    unsigned int AER3:1;                    /**< \brief [18:18] Accumulated Triple Bit ECC Errors (rh) */
    unsigned int AERM:1;                    /**< \brief [19:19] Accumulated Multi-bit ECC Errors (rh) */
    unsigned int reserved_20:3;             /**< \brief \internal Reserved */
    unsigned int AERANY:1;                  /**< \brief [23:23] Accumulated Any Read Access ECC Error (rh) */
    unsigned int ABLANKD:1;                 /**< \brief [24:24] Accumulated Blank Digital (rh) */
    unsigned int ABLANKA:1;                 /**< \brief [25:25] Accumulated Blank Analog (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_DMU_SF_ECCS_Bits;

/** \brief  DF1 ECC Write Register */
typedef struct _Ifx_DMU_SF_ECCW_Bits
{
    unsigned int WCODE:22;                  /**< \brief [21:0] Error Correction Write Code (rw) */
    unsigned int reserved_22:8;             /**< \brief \internal Reserved */
    unsigned int ECCENCDIS:2;               /**< \brief [31:30] ECC Encoding Disable (rw) */
} Ifx_DMU_SF_ECCW_Bits;

/** \brief  HSM Enable Error Interrupt Control Register */
typedef struct _Ifx_DMU_SF_EER_Bits
{
    unsigned int OPERM:1;                   /**< \brief [0:0] Operation Error Interrupt Mask (rw) */
    unsigned int SQERM:1;                   /**< \brief [1:1] Command Sequence Error Interrupt Mask (rw) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int PVERM:1;                   /**< \brief [3:3] Program Verify Error Interrupt Mask (rw) */
    unsigned int EVERM:1;                   /**< \brief [4:4] Erase Verify Error Interrupt Mask (rw) */
    unsigned int reserved_5:26;             /**< \brief \internal Reserved */
    unsigned int EOBM:1;                    /**< \brief [31:31] End of Busy Interrupt Mask (rw) */
} Ifx_DMU_SF_EER_Bits;

/** \brief  HSM Error Status Register */
typedef struct _Ifx_DMU_SF_ERRSR_Bits
{
    unsigned int OPER:1;                    /**< \brief [0:0] Flash Operation Error (rh) */
    unsigned int SQER:1;                    /**< \brief [1:1] Command Sequence Error (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int PVER:1;                    /**< \brief [3:3] Program Verify Error (rh) */
    unsigned int EVER:1;                    /**< \brief [4:4] Erase Verify Error (rh) */
    unsigned int reserved_5:27;             /**< \brief \internal Reserved */
} Ifx_DMU_SF_ERRSR_Bits;

/** \brief  DF1 Margin Control Register */
typedef struct _Ifx_DMU_SF_MARGIN_Bits
{
    unsigned int SELD1:2;                   /**< \brief [1:0] DF1 Margin Read Selection (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_DMU_SF_MARGIN_Bits;

/** \brief  Flash Operation Register */
typedef struct _Ifx_DMU_SF_OPERATION_Bits
{
    unsigned int PROG:1;                    /**< \brief [0:0] Programming State (rh) */
    unsigned int ERASE:1;                   /**< \brief [1:1] Erase State (rh) */
    unsigned int USER:1;                    /**< \brief [2:2] User State (rh) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_DMU_SF_OPERATION_Bits;

/** \brief  DF1 User Mode Control */
typedef struct _Ifx_DMU_SF_PROCONUSR_Bits
{
    unsigned int MODE:2;                    /**< \brief [1:0] DF1 User Mode Control (rh) */
    unsigned int UCB:30;                    /**< \brief [31:2] Reserved for UCB (rh) */
} Ifx_DMU_SF_PROCONUSR_Bits;

/** \brief  HSM Flash Status Register */
typedef struct _Ifx_DMU_SF_STATUS_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int D1BUSY:1;                  /**< \brief [1:1] Data Flash Bank 1 Busy (rh) */
    unsigned int reserved_2:18;             /**< \brief \internal Reserved */
    unsigned int DFPAGE:1;                  /**< \brief [20:20] Data Flash in Page Mode (rh) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_DMU_SF_STATUS_Bits;

