Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  HSM Suspend Control Register */
typedef struct _Ifx_DMU_SF_SUSPEND_Bits
{
    unsigned int REQ:1;                     /**< \brief [0:0] Suspend Request (rwh) */
    unsigned int CLR:1;                     /**< \brief [1:1] Suspend Clear (w) */
    unsigned int reserved_2:14;             /**< \brief \internal Reserved */
    unsigned int SPND:1;                    /**< \brief [16:16] Flash Operation Suspended (rh) */
    unsigned int ERR:1;                     /**< \brief [17:17] Suspend Error (rh) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_DMU_SF_SUSPEND_Bits;

/** \brief  HSM Interface Protection Configuration */
typedef struct _Ifx_DMU_SP_PROCONHSM_Bits
{
    unsigned int HSMDBGDIS:1;               /**< \brief [0:0] HSM Debug Disable (rh) */
    unsigned int DBGIFLCK:1;                /**< \brief [1:1] Debug Interface Locked (rh) */
    unsigned int TSTIFLCK:1;                /**< \brief [2:2] Test Interface Locked (rh) */
    unsigned int HSMTSTDIS:1;               /**< \brief [3:3] HSM Test Disable (rh) */
    unsigned int HSMTRDIS:2;                /**< \brief [5:4] HSM Trace Disable (rh) */
    unsigned int HSMTRTYPE:1;               /**< \brief [6:6] HSM Type of Trace (rh) */
    unsigned int UCB:9;                     /**< \brief [15:7] Reserved for UCB (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_DMU_SP_PROCONHSM_Bits;

/** \brief  HSM Code Boot Sector */
typedef struct _Ifx_DMU_SP_PROCONHSMCBS_Bits
{
    unsigned int BOOTSEL0:6;                /**< \brief [5:0] Boot Sector Selection (rh) */
    unsigned int UCB:2;                     /**< \brief [7:6] Reserved for UCB (rh) */
    unsigned int BOOTSEL1:6;                /**< \brief [13:8] Boot Sector Selection (rh) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int BOOTSEL2:6;                /**< \brief [21:16] Boot Sector Selection (rh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int BOOTSEL3:6;                /**< \brief [29:24] Boot Sector Selection (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DMU_SP_PROCONHSMCBS_Bits;

/** \brief  HSM Protection Configuration */
typedef struct _Ifx_DMU_SP_PROCONHSMCFG_Bits
{
    unsigned int HSMBOOTEN:1;               /**< \brief [0:0] HSM Boot Enable (rh) */
    unsigned int SSWWAIT:1;                 /**< \brief [1:1] SSW Wait (rh) */
    unsigned int HSMDX:1;                   /**< \brief [2:2] HSM Data Sectors Exclusive (rh) */
    unsigned int UCB:1;                     /**< \brief [3:3] Reserved for UCB (rh) */
    unsigned int HSMRAMKEEP:2;              /**< \brief [5:4] HSM RAM Clear (rh) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int HSMENPINS:2;               /**< \brief [8:7] Enable HSM Forcing of Pins HSM1/2 (rh) */
    unsigned int HSMENRES:2;                /**< \brief [10:9] Enable HSM Triggering Resets (rh) */
    unsigned int DESTDBG:2;                 /**< \brief [12:11] Destructive Debug Entry (rh) */
    unsigned int BLKFLAN:1;                 /**< \brief [13:13] Block Flash Analysis (rh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_DMU_SP_PROCONHSMCFG_Bits;

/** \brief  HSM Code OTP Protection Configuration */
typedef struct _Ifx_DMU_SP_PROCONHSMCOTP0_Bits
{
    unsigned int HSM0ROM:1;                 /**< \brief [0:0] PFLASH Sector 0 HSM Code Locked Forever (rh) */
    unsigned int HSM1ROM:1;                 /**< \brief [1:1] PFLASH Sector 1 HSM Code Locked Forever (rh) */
    unsigned int HSM2ROM:1;                 /**< \brief [2:2] PFLASH Sector 2 HSM Code Locked Forever (rh) */
    unsigned int HSM3ROM:1;                 /**< \brief [3:3] PFLASH Sector 3 HSM Code Locked Forever (rh) */
    unsigned int HSM4ROM:1;                 /**< \brief [4:4] PFLASH Sector 4 HSM Code Locked Forever (rh) */
    unsigned int HSM5ROM:1;                 /**< \brief [5:5] PFLASH Sector 5 HSM Code Locked Forever (rh) */
    unsigned int HSM6ROM:1;                 /**< \brief [6:6] PFLASH Sector 6 HSM Code Locked Forever (rh) */
    unsigned int HSM7ROM:1;                 /**< \brief [7:7] PFLASH Sector 7 HSM Code Locked Forever (rh) */
    unsigned int HSM8ROM:1;                 /**< \brief [8:8] PFLASH Sector 8 HSM Code Locked Forever (rh) */
    unsigned int HSM9ROM:1;                 /**< \brief [9:9] PFLASH Sector 9 HSM Code Locked Forever (rh) */
    unsigned int HSM10ROM:1;                /**< \brief [10:10] PFLASH Sector 10 HSM Code Locked Forever (rh) */
    unsigned int HSM11ROM:1;                /**< \brief [11:11] PFLASH Sector 11 HSM Code Locked Forever (rh) */
    unsigned int HSM12ROM:1;                /**< \brief [12:12] PFLASH Sector 12 HSM Code Locked Forever (rh) */
    unsigned int HSM13ROM:1;                /**< \brief [13:13] PFLASH Sector 13 HSM Code Locked Forever (rh) */
    unsigned int HSM14ROM:1;                /**< \brief [14:14] PFLASH Sector 14 HSM Code Locked Forever (rh) */
    unsigned int HSM15ROM:1;                /**< \brief [15:15] PFLASH Sector 15 HSM Code Locked Forever (rh) */
    unsigned int HSM16ROM:1;                /**< \brief [16:16] PFLASH Sector 16 HSM Code Locked Forever (rh) */
    unsigned int HSM17ROM:1;                /**< \brief [17:17] PFLASH Sector 17 HSM Code Locked Forever (rh) */
    unsigned int HSM18ROM:1;                /**< \brief [18:18] PFLASH Sector 18 HSM Code Locked Forever (rh) */
    unsigned int HSM19ROM:1;                /**< \brief [19:19] PFLASH Sector 19 HSM Code Locked Forever (rh) */
    unsigned int HSM20ROM:1;                /**< \brief [20:20] PFLASH Sector 20 HSM Code Locked Forever (rh) */
    unsigned int HSM21ROM:1;                /**< \brief [21:21] PFLASH Sector 21 HSM Code Locked Forever (rh) */
    unsigned int HSM22ROM:1;                /**< \brief [22:22] PFLASH Sector 22 HSM Code Locked Forever (rh) */
    unsigned int HSM23ROM:1;                /**< \brief [23:23] PFLASH Sector 23 HSM Code Locked Forever (rh) */
    unsigned int HSM24ROM:1;                /**< \brief [24:24] PFLASH Sector 24 HSM Code Locked Forever (rh) */
    unsigned int HSM25ROM:1;                /**< \brief [25:25] PFLASH Sector 25 HSM Code Locked Forever (rh) */
    unsigned int HSM26ROM:1;                /**< \brief [26:26] PFLASH Sector 26 HSM Code Locked Forever (rh) */
    unsigned int HSM27ROM:1;                /**< \brief [27:27] PFLASH Sector 27 HSM Code Locked Forever (rh) */
    unsigned int HSM28ROM:1;                /**< \brief [28:28] PFLASH Sector 28 HSM Code Locked Forever (rh) */
    unsigned int HSM29ROM:1;                /**< \brief [29:29] PFLASH Sector 29 HSM Code Locked Forever (rh) */
    unsigned int HSM30ROM:1;                /**< \brief [30:30] PFLASH Sector 30 HSM Code Locked Forever (rh) */
    unsigned int HSM31ROM:1;                /**< \brief [31:31] PFLASH Sector 31 HSM Code Locked Forever (rh) */
} Ifx_DMU_SP_PROCONHSMCOTP0_Bits;

/** \brief  HSM Code OTP Protection Configuration */
typedef struct _Ifx_DMU_SP_PROCONHSMCOTP1_Bits
{
    unsigned int HSM32ROM:1;                /**< \brief [0:0] PFLASH Sector 32 HSM Code Locked Forever (rh) */
    unsigned int HSM33ROM:1;                /**< \brief [1:1] PFLASH Sector 33 HSM Code Locked Forever (rh) */
    unsigned int HSM34ROM:1;                /**< \brief [2:2] PFLASH Sector 34 HSM Code Locked Forever (rh) */
    unsigned int HSM35ROM:1;                /**< \brief [3:3] PFLASH Sector 35 HSM Code Locked Forever (rh) */
    unsigned int HSM36ROM:1;                /**< \brief [4:4] PFLASH Sector 36 HSM Code Locked Forever (rh) */
    unsigned int HSM37ROM:1;                /**< \brief [5:5] PFLASH Sector 37 HSM Code Locked Forever (rh) */
    unsigned int HSM38ROM:1;                /**< \brief [6:6] PFLASH Sector 38 HSM Code Locked Forever (rh) */
    unsigned int HSM39ROM:1;                /**< \brief [7:7] PFLASH Sector 39 HSM Code Locked Forever (rh) */
    unsigned int UCB:24;                    /**< \brief [31:8] Reserved for UCB (rh) */
} Ifx_DMU_SP_PROCONHSMCOTP1_Bits;

