Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  HSM Code Exclusive Protection Configuration */
typedef struct _Ifx_DMU_SP_PROCONHSMCX0_Bits
{
    unsigned int HSM0X:1;                   /**< \brief [0:0] PFLASH Sector 0 HSM Code Exclusive (rh) */
    unsigned int HSM1X:1;                   /**< \brief [1:1] PFLASH Sector 1 HSM Code Exclusive (rh) */
    unsigned int HSM2X:1;                   /**< \brief [2:2] PFLASH Sector 2 HSM Code Exclusive (rh) */
    unsigned int HSM3X:1;                   /**< \brief [3:3] PFLASH Sector 3 HSM Code Exclusive (rh) */
    unsigned int HSM4X:1;                   /**< \brief [4:4] PFLASH Sector 4 HSM Code Exclusive (rh) */
    unsigned int HSM5X:1;                   /**< \brief [5:5] PFLASH Sector 5 HSM Code Exclusive (rh) */
    unsigned int HSM6X:1;                   /**< \brief [6:6] PFLASH Sector 6 HSM Code Exclusive (rh) */
    unsigned int HSM7X:1;                   /**< \brief [7:7] PFLASH Sector 7 HSM Code Exclusive (rh) */
    unsigned int HSM8X:1;                   /**< \brief [8:8] PFLASH Sector 8 HSM Code Exclusive (rh) */
    unsigned int HSM9X:1;                   /**< \brief [9:9] PFLASH Sector 9 HSM Code Exclusive (rh) */
    unsigned int HSM10X:1;                  /**< \brief [10:10] PFLASH Sector 10 HSM Code Exclusive (rh) */
    unsigned int HSM11X:1;                  /**< \brief [11:11] PFLASH Sector 11 HSM Code Exclusive (rh) */
    unsigned int HSM12X:1;                  /**< \brief [12:12] PFLASH Sector 12 HSM Code Exclusive (rh) */
    unsigned int HSM13X:1;                  /**< \brief [13:13] PFLASH Sector 13 HSM Code Exclusive (rh) */
    unsigned int HSM14X:1;                  /**< \brief [14:14] PFLASH Sector 14 HSM Code Exclusive (rh) */
    unsigned int HSM15X:1;                  /**< \brief [15:15] PFLASH Sector 15 HSM Code Exclusive (rh) */
    unsigned int HSM16X:1;                  /**< \brief [16:16] PFLASH Sector 16 HSM Code Exclusive (rh) */
    unsigned int HSM17X:1;                  /**< \brief [17:17] PFLASH Sector 17 HSM Code Exclusive (rh) */
    unsigned int HSM18X:1;                  /**< \brief [18:18] PFLASH Sector 18 HSM Code Exclusive (rh) */
    unsigned int HSM19X:1;                  /**< \brief [19:19] PFLASH Sector 19 HSM Code Exclusive (rh) */
    unsigned int HSM20X:1;                  /**< \brief [20:20] PFLASH Sector 20 HSM Code Exclusive (rh) */
    unsigned int HSM21X:1;                  /**< \brief [21:21] PFLASH Sector 21 HSM Code Exclusive (rh) */
    unsigned int HSM22X:1;                  /**< \brief [22:22] PFLASH Sector 22 HSM Code Exclusive (rh) */
    unsigned int HSM23X:1;                  /**< \brief [23:23] PFLASH Sector 23 HSM Code Exclusive (rh) */
    unsigned int HSM24X:1;                  /**< \brief [24:24] PFLASH Sector 24 HSM Code Exclusive (rh) */
    unsigned int HSM25X:1;                  /**< \brief [25:25] PFLASH Sector 25 HSM Code Exclusive (rh) */
    unsigned int HSM26X:1;                  /**< \brief [26:26] PFLASH Sector 26 HSM Code Exclusive (rh) */
    unsigned int HSM27X:1;                  /**< \brief [27:27] PFLASH Sector 27 HSM Code Exclusive (rh) */
    unsigned int HSM28X:1;                  /**< \brief [28:28] PFLASH Sector 28 HSM Code Exclusive (rh) */
    unsigned int HSM29X:1;                  /**< \brief [29:29] PFLASH Sector 29 HSM Code Exclusive (rh) */
    unsigned int HSM30X:1;                  /**< \brief [30:30] PFLASH Sector 30 HSM Code Exclusive (rh) */
    unsigned int HSM31X:1;                  /**< \brief [31:31] PFLASH Sector 31 HSM Code Exclusive (rh) */
} Ifx_DMU_SP_PROCONHSMCX0_Bits;

/** \brief  HSM Code Exclusive Protection Configuration */
typedef struct _Ifx_DMU_SP_PROCONHSMCX1_Bits
{
    unsigned int HSM32X:1;                  /**< \brief [0:0] PFLASH Sector 32 HSM Code Exclusive (rh) */
    unsigned int HSM33X:1;                  /**< \brief [1:1] PFLASH Sector 33 HSM Code Exclusive (rh) */
    unsigned int HSM34X:1;                  /**< \brief [2:2] PFLASH Sector 34 HSM Code Exclusive (rh) */
    unsigned int HSM35X:1;                  /**< \brief [3:3] PFLASH Sector 35 HSM Code Exclusive (rh) */
    unsigned int HSM36X:1;                  /**< \brief [4:4] PFLASH Sector 36 HSM Code Exclusive (rh) */
    unsigned int HSM37X:1;                  /**< \brief [5:5] PFLASH Sector 37 HSM Code Exclusive (rh) */
    unsigned int HSM38X:1;                  /**< \brief [6:6] PFLASH Sector 38 HSM Code Exclusive (rh) */
    unsigned int HSM39X:1;                  /**< \brief [7:7] PFLASH Sector 39 HSM Code Exclusive (rh) */
    unsigned int UCB:24;                    /**< \brief [31:8] Reserved for UCB (rh) */
} Ifx_DMU_SP_PROCONHSMCX1_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dmu_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_ACCEN0_Bits B;               /**< \brief Bitfield access */
} Ifx_DMU_HF_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_ACCEN1_Bits B;               /**< \brief Bitfield access */
} Ifx_DMU_HF_ACCEN1;

/** \brief  Cranking Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_CCONTROL_Bits B;             /**< \brief Bitfield access */
} Ifx_DMU_HF_CCONTROL;

/** \brief  Clear Error Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_CLRE_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_HF_CLRE;

/** \brief  Flash Confirm Status Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_CONFIRM0_Bits B;             /**< \brief Bitfield access */
} Ifx_DMU_HF_CONFIRM0;

