Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  Flash Confirm Status Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_CONFIRM1_Bits B;             /**< \brief Bitfield access */
} Ifx_DMU_HF_CONFIRM1;

/** \brief  Flash Confirm Status Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_CONFIRM2_Bits B;             /**< \brief Bitfield access */
} Ifx_DMU_HF_CONFIRM2;

/** \brief  Flash Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_CONTROL_Bits B;              /**< \brief Bitfield access */
} Ifx_DMU_HF_CONTROL;

/** \brief  DFLASH Size Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_DSIZE_Bits B;                /**< \brief Bitfield access */
} Ifx_DMU_HF_DSIZE;

/** \brief  DFLASH Wait Cycle Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_DWAIT_Bits B;                /**< \brief Bitfield access */
} Ifx_DMU_HF_DWAIT;

/** \brief  DF0 ECC Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_ECCC_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_HF_ECCC;

/** \brief  DF0 ECC Read Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_ECCR_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_HF_ECCR;

/** \brief  DF0 ECC Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_ECCS_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_HF_ECCS;

/** \brief  DF0 ECC Write Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_ECCW_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_HF_ECCW;

/** \brief  Enable Error Interrupt Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_EER_Bits B;                  /**< \brief Bitfield access */
} Ifx_DMU_HF_EER;

/** \brief  Error Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_ERRSR_Bits B;                /**< \brief Bitfield access */
} Ifx_DMU_HF_ERRSR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_ID_Bits B;                   /**< \brief Bitfield access */
} Ifx_DMU_HF_ID;

/** \brief  Margin Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_MARGIN_Bits B;               /**< \brief Bitfield access */
} Ifx_DMU_HF_MARGIN;

/** \brief  Flash Operation Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_OPERATION_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HF_OPERATION;

/** \brief  Power Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PCONTROL_Bits B;             /**< \brief Bitfield access */
} Ifx_DMU_HF_PCONTROL;

/** \brief  Debug Interface Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PROCONDBG_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HF_PROCONDBG;

/** \brief  DFLASH Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PROCONDF_Bits B;             /**< \brief Bitfield access */
} Ifx_DMU_HF_PROCONDF;

/** \brief  PFLASH Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PROCONPF_Bits B;             /**< \brief Bitfield access */
} Ifx_DMU_HF_PROCONPF;

/** \brief  RAM Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PROCONRAM_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HF_PROCONRAM;

/** \brief  Tuning Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PROCONTP_Bits B;             /**< \brief Bitfield access */
} Ifx_DMU_HF_PROCONTP;

/** \brief  DF0 User Mode Control */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PROCONUSR_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HF_PROCONUSR;

/** \brief  Flash Protection Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PROTECT_Bits B;              /**< \brief Bitfield access */
} Ifx_DMU_HF_PROTECT;

