Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  PFLASH Bank Size Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PSIZE_Bits B;                /**< \brief Bitfield access */
} Ifx_DMU_HF_PSIZE;

/** \brief  Power Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PSTATUS_Bits B;              /**< \brief Bitfield access */
} Ifx_DMU_HF_PSTATUS;

/** \brief  PFLASH Wait Cycle Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_PWAIT_Bits B;                /**< \brief Bitfield access */
} Ifx_DMU_HF_PWAIT;

/** \brief  Flash Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_STATUS_Bits B;               /**< \brief Bitfield access */
} Ifx_DMU_HF_STATUS;

/** \brief  Suspend Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HF_SUSPEND_Bits B;              /**< \brief Bitfield access */
} Ifx_DMU_HF_SUSPEND;

/** \brief  PFLASH Bank OTP Protection Configuration 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_OTP0_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_OTP0;

/** \brief  PFLASH Bank OTP Protection Configuration 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_OTP1_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_OTP1;

/** \brief  PFLASH Bank OTP Protection Configuration 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_OTP2_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_OTP2;

/** \brief  PFLASH Bank OTP Protection Configuration 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_OTP3_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_OTP3;

/** \brief  PFLASH Bank OTP Protection Configuration 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_OTP4_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_OTP4;

/** \brief  PFLASH Bank OTP Protection Configuration 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_OTP5_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_OTP5;

/** \brief  PFLASH Bank Protection Configuration 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_P0_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_P0;

/** \brief  PFLASH Bank Protection Configuration 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_P1_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_P1;

/** \brief  PFLASH Bank Protection Configuration 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_P2_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_P2;

/** \brief  PFLASH Bank Protection Configuration 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_P3_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_P3;

/** \brief  PFLASH Bank Protection Configuration 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_P4_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_P4;

/** \brief  PFLASH Bank Protection Configuration 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_P5_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_P5;

/** \brief  PFLASH Bank WOP Configuration 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_WOP0_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_WOP0;

/** \brief  PFLASH Bank WOP Configuration 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_WOP1_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_WOP1;

/** \brief  PFLASH Bank WOP Configuration 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_WOP2_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_WOP2;

/** \brief  PFLASH Bank WOP Configuration 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_WOP3_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_WOP3;

/** \brief  PFLASH Bank WOP Configuration 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_WOP4_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_WOP4;

/** \brief  PFLASH Bank WOP Configuration 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_HP_PROCON_WOP5_Bits B;          /**< \brief Bitfield access */
} Ifx_DMU_HP_PROCON_WOP5;

/** \brief  Clear Error Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_CLRE_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_SF_CLRE;

/** \brief  HSM Flash Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_CONTROL_Bits B;              /**< \brief Bitfield access */
} Ifx_DMU_SF_CONTROL;

