Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  DF1 ECC Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_ECCC_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_SF_ECCC;

/** \brief  DF1 ECC Read Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_ECCR_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_SF_ECCR;

/** \brief  DF1 ECC Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_ECCS_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_SF_ECCS;

/** \brief  DF1 ECC Write Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_ECCW_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMU_SF_ECCW;

/** \brief  HSM Enable Error Interrupt Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_EER_Bits B;                  /**< \brief Bitfield access */
} Ifx_DMU_SF_EER;

/** \brief  HSM Error Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_ERRSR_Bits B;                /**< \brief Bitfield access */
} Ifx_DMU_SF_ERRSR;

/** \brief  DF1 Margin Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_MARGIN_Bits B;               /**< \brief Bitfield access */
} Ifx_DMU_SF_MARGIN;

/** \brief  Flash Operation Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_OPERATION_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_SF_OPERATION;

/** \brief  DF1 User Mode Control */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_PROCONUSR_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_SF_PROCONUSR;

/** \brief  HSM Flash Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_STATUS_Bits B;               /**< \brief Bitfield access */
} Ifx_DMU_SF_STATUS;

/** \brief  HSM Suspend Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SF_SUSPEND_Bits B;              /**< \brief Bitfield access */
} Ifx_DMU_SF_SUSPEND;

/** \brief  HSM Interface Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SP_PROCONHSM_Bits B;            /**< \brief Bitfield access */
} Ifx_DMU_SP_PROCONHSM;

/** \brief  HSM Code Boot Sector */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SP_PROCONHSMCBS_Bits B;         /**< \brief Bitfield access */
} Ifx_DMU_SP_PROCONHSMCBS;

/** \brief  HSM Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SP_PROCONHSMCFG_Bits B;         /**< \brief Bitfield access */
} Ifx_DMU_SP_PROCONHSMCFG;

/** \brief  HSM Code OTP Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SP_PROCONHSMCOTP0_Bits B;       /**< \brief Bitfield access */
} Ifx_DMU_SP_PROCONHSMCOTP0;

/** \brief  HSM Code OTP Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SP_PROCONHSMCOTP1_Bits B;       /**< \brief Bitfield access */
} Ifx_DMU_SP_PROCONHSMCOTP1;

/** \brief  HSM Code Exclusive Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SP_PROCONHSMCX0_Bits B;         /**< \brief Bitfield access */
} Ifx_DMU_SP_PROCONHSMCX0;

/** \brief  HSM Code Exclusive Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMU_SP_PROCONHSMCX1_Bits B;         /**< \brief Bitfield access */
} Ifx_DMU_SP_PROCONHSMCX1;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dmu_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  PFLASH Bank Protection Object */
typedef volatile struct _Ifx_DMU_HP_PROCON
{
    Ifx_DMU_HP_PROCON_P0 P0;                /**< \brief 0, PFLASH Bank Protection Configuration 0 */
    Ifx_DMU_HP_PROCON_P1 P1;                /**< \brief 4, PFLASH Bank Protection Configuration 1 */
    Ifx_DMU_HP_PROCON_P2 P2;                /**< \brief 8, PFLASH Bank Protection Configuration 2 */
    Ifx_DMU_HP_PROCON_P3 P3;                /**< \brief C, PFLASH Bank Protection Configuration 3 */
    Ifx_DMU_HP_PROCON_P4 P4;                /**< \brief 10, PFLASH Bank Protection Configuration 4 */
    Ifx_DMU_HP_PROCON_P5 P5;                /**< \brief 14, PFLASH Bank Protection Configuration 5 */
    unsigned char reserved_18[40];          /**< \brief 18, \internal Reserved */
    Ifx_DMU_HP_PROCON_OTP0 OTP0;            /**< \brief 40, PFLASH Bank OTP Protection Configuration 0 */
    Ifx_DMU_HP_PROCON_OTP1 OTP1;            /**< \brief 44, PFLASH Bank OTP Protection Configuration 1 */
    Ifx_DMU_HP_PROCON_OTP2 OTP2;            /**< \brief 48, PFLASH Bank OTP Protection Configuration 2 */
    Ifx_DMU_HP_PROCON_OTP3 OTP3;            /**< \brief 4C, PFLASH Bank OTP Protection Configuration 3 */
    Ifx_DMU_HP_PROCON_OTP4 OTP4;            /**< \brief 50, PFLASH Bank OTP Protection Configuration 4 */
    Ifx_DMU_HP_PROCON_OTP5 OTP5;            /**< \brief 54, PFLASH Bank OTP Protection Configuration 5 */
    unsigned char reserved_58[40];          /**< \brief 58, \internal Reserved */
    Ifx_DMU_HP_PROCON_WOP0 WOP0;            /**< \brief 80, PFLASH Bank WOP Configuration 0 */
    Ifx_DMU_HP_PROCON_WOP1 WOP1;            /**< \brief 84, PFLASH Bank WOP Configuration 1 */
    Ifx_DMU_HP_PROCON_WOP2 WOP2;            /**< \brief 88, PFLASH Bank WOP Configuration 2 */
    Ifx_DMU_HP_PROCON_WOP3 WOP3;            /**< \brief 8C, PFLASH Bank WOP Configuration 3 */
    Ifx_DMU_HP_PROCON_WOP4 WOP4;            /**< \brief 90, PFLASH Bank WOP Configuration 4 */
    Ifx_DMU_HP_PROCON_WOP5 WOP5;            /**< \brief 94, PFLASH Bank WOP Configuration 5 */
    unsigned char reserved_98[104];         /**< \brief 98, \internal Reserved */
} Ifx_DMU_HP_PROCON;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dmu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

