Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_regdef.h
/** \brief  DMU object */
typedef volatile struct _Ifx_DMU
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_DMU_HF_ID HF_ID;                    /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_DMU_HF_STATUS HF_STATUS;            /**< \brief 10, Flash Status Register */
    Ifx_DMU_HF_CONTROL HF_CONTROL;          /**< \brief 14, Flash Control Register */
    Ifx_DMU_HF_OPERATION HF_OPERATION;      /**< \brief 18, Flash Operation Register */
    Ifx_DMU_HF_PROTECT HF_PROTECT;          /**< \brief 1C, Flash Protection Status Register */
    Ifx_DMU_HF_CONFIRM0 HF_CONFIRM0;        /**< \brief 20, Flash Confirm Status Register 0 */
    Ifx_DMU_HF_CONFIRM1 HF_CONFIRM1;        /**< \brief 24, Flash Confirm Status Register 1 */
    Ifx_DMU_HF_CONFIRM2 HF_CONFIRM2;        /**< \brief 28, Flash Confirm Status Register 2 */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_DMU_HF_EER HF_EER;                  /**< \brief 30, Enable Error Interrupt Control Register */
    Ifx_DMU_HF_ERRSR HF_ERRSR;              /**< \brief 34, Error Status Register */
    Ifx_DMU_HF_CLRE HF_CLRE;                /**< \brief 38, Clear Error Register */
    unsigned char reserved_3C[4];           /**< \brief 3C, \internal Reserved */
    Ifx_DMU_HF_ECCR HF_ECCR;                /**< \brief 40, DF0 ECC Read Register */
    Ifx_DMU_HF_ECCS HF_ECCS;                /**< \brief 44, DF0 ECC Status Register */
    Ifx_DMU_HF_ECCC HF_ECCC;                /**< \brief 48, DF0 ECC Control Register */
    Ifx_DMU_HF_ECCW HF_ECCW;                /**< \brief 4C, DF0 ECC Write Register */
    Ifx_DMU_HF_CCONTROL HF_CCONTROL;        /**< \brief 50, Cranking Control Register */
    unsigned char reserved_54[12];          /**< \brief 54, \internal Reserved */
    Ifx_DMU_HF_PSTATUS HF_PSTATUS;          /**< \brief 60, Power Status Register */
    Ifx_DMU_HF_PCONTROL HF_PCONTROL;        /**< \brief 64, Power Control Register */
    Ifx_DMU_HF_PWAIT HF_PWAIT;              /**< \brief 68, PFLASH Wait Cycle Register */
    Ifx_DMU_HF_DWAIT HF_DWAIT;              /**< \brief 6C, DFLASH Wait Cycle Register */
    unsigned char reserved_70[4];           /**< \brief 70, \internal Reserved */
    Ifx_DMU_HF_PROCONUSR HF_PROCONUSR;      /**< \brief 74, DF0 User Mode Control */
    unsigned char reserved_78[8];           /**< \brief 78, \internal Reserved */
    Ifx_DMU_HF_PROCONPF HF_PROCONPF;        /**< \brief 80, PFLASH Protection Configuration */
    Ifx_DMU_HF_PROCONTP HF_PROCONTP;        /**< \brief 84, Tuning Protection Configuration */
    Ifx_DMU_HF_PROCONDF HF_PROCONDF;        /**< \brief 88, DFLASH Protection Configuration */
    Ifx_DMU_HF_PROCONRAM HF_PROCONRAM;      /**< \brief 8C, RAM Configuration */
    Ifx_DMU_HF_PROCONDBG HF_PROCONDBG;      /**< \brief 90, Debug Interface Protection Configuration */
    unsigned char reserved_94[12];          /**< \brief 94, \internal Reserved */
    Ifx_DMU_HF_DSIZE HF_DSIZE;              /**< \brief A0, DFLASH Size Configuration Register */
    unsigned char reserved_A4[12];          /**< \brief A4, \internal Reserved */
    Ifx_DMU_HF_PSIZE HF_PSIZE[6];           /**< \brief B0, PFLASH Bank Size Configuration Register */
    unsigned char reserved_C8[24];          /**< \brief C8, \internal Reserved */
    unsigned char reserved_E0[4];           /**< \brief E0, \internal Reserved  */
    unsigned char reserved_E4[4];           /**< \brief E4, \internal Reserved  */
    unsigned char reserved_E8[4];           /**< \brief E8, \internal Reserved */
    unsigned char reserved_EC[4];           /**< \brief EC, \internal Reserved */
    Ifx_DMU_HF_SUSPEND HF_SUSPEND;          /**< \brief F0, Suspend Control Register */
    Ifx_DMU_HF_MARGIN HF_MARGIN;            /**< \brief F4, Margin Control Register */
    Ifx_DMU_HF_ACCEN1 HF_ACCEN1;            /**< \brief F8, Access Enable Register 1 */
    Ifx_DMU_HF_ACCEN0 HF_ACCEN0;            /**< \brief FC, Access Enable Register 0 */
    unsigned char reserved_100[65280];      /**< \brief 100, \internal Reserved */
    Ifx_DMU_HP_PROCON HP_PROCON[6];         /**< \brief 10000, PFLASH Bank Protection Object */
    unsigned char reserved_10600[64016];    /**< \brief 10600, \internal Reserved */
    Ifx_DMU_SF_STATUS SF_STATUS;            /**< \brief 20010, HSM Flash Status Register */
    Ifx_DMU_SF_CONTROL SF_CONTROL;          /**< \brief 20014, HSM Flash Configuration Register */
    Ifx_DMU_SF_OPERATION SF_OPERATION;      /**< \brief 20018, Flash Operation Register */
    unsigned char reserved_2001C[20];       /**< \brief 2001C, \internal Reserved */
    Ifx_DMU_SF_EER SF_EER;                  /**< \brief 20030, HSM Enable Error Interrupt Control Register */
    Ifx_DMU_SF_ERRSR SF_ERRSR;              /**< \brief 20034, HSM Error Status Register */
    Ifx_DMU_SF_CLRE SF_CLRE;                /**< \brief 20038, Clear Error Register */
    unsigned char reserved_2003C[4];        /**< \brief 2003C, \internal Reserved */
    Ifx_DMU_SF_ECCR SF_ECCR;                /**< \brief 20040, DF1 ECC Read Register */
    Ifx_DMU_SF_ECCS SF_ECCS;                /**< \brief 20044, DF1 ECC Status Register */
    Ifx_DMU_SF_ECCC SF_ECCC;                /**< \brief 20048, DF1 ECC Control Register */
    Ifx_DMU_SF_ECCW SF_ECCW;                /**< \brief 2004C, DF1 ECC Write Register */
    unsigned char reserved_20050[32];       /**< \brief 20050, \internal Reserved */
    unsigned char reserved_20070[4];        /**< \brief 20070, \internal Reserved  */
    Ifx_DMU_SF_PROCONUSR SF_PROCONUSR;      /**< \brief 20074, DF1 User Mode Control */
    unsigned char reserved_20078[112];      /**< \brief 20078, \internal Reserved */
    Ifx_DMU_SF_SUSPEND SF_SUSPEND;          /**< \brief 200E8, HSM Suspend Control Register */
    Ifx_DMU_SF_MARGIN SF_MARGIN;            /**< \brief 200EC, DF1 Margin Control Register */
    unsigned char reserved_200F0[65296];    /**< \brief 200F0, \internal Reserved */
    Ifx_DMU_SP_PROCONHSMCFG SP_PROCONHSMCFG;    /**< \brief 30000, HSM Protection Configuration */
    Ifx_DMU_SP_PROCONHSMCBS SP_PROCONHSMCBS;    /**< \brief 30004, HSM Code Boot Sector */
    Ifx_DMU_SP_PROCONHSMCX0 SP_PROCONHSMCX0;    /**< \brief 30008, HSM Code Exclusive Protection Configuration */
    Ifx_DMU_SP_PROCONHSMCX1 SP_PROCONHSMCX1;    /**< \brief 3000C, HSM Code Exclusive Protection Configuration */
    Ifx_DMU_SP_PROCONHSMCOTP0 SP_PROCONHSMCOTP0;    /**< \brief 30010, HSM Code OTP Protection Configuration */
    Ifx_DMU_SP_PROCONHSMCOTP1 SP_PROCONHSMCOTP1;    /**< \brief 30014, HSM Code OTP Protection Configuration */
    unsigned char reserved_30018[40];       /**< \brief 30018, \internal Reserved */
    Ifx_DMU_SP_PROCONHSM SP_PROCONHSM;      /**< \brief 30040, HSM Interface Protection Configuration */
    unsigned char reserved_30044[65468];    /**< \brief 30044, \internal Reserved */
} Ifx_DMU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMU_REGDEF_H */
